Repository: VladimirKhil/SI
Catalog: src/SIGame/SIGame/Properties/Resources.*.resx
Languages: ru_ru

# About_Author
source: Author: Vladimir Khil
ru_ru: Автор: Владимир Хиль

# About_Site
source: Website
ru_ru: Сайт программы

source: Address
ru_ru: Адрес

source: Add table
ru_ru: Добавить стол

source: All
ru_ru: Все

# AllInOnQuestion1
source: Odds: All-in in a question of the 1st category
ru_ru: Вероятность: ВА-БАНК на вопросе 1 категории

# AllInOnQuestion5
source: Odds: All-in in a question of the 5th category
ru_ru: Вероятность: ВА-БАНК на вопросе 5 категории

source: Answer check
ru_ru: Проверка ответа

# Apellate_Right
source: I am right!
ru_ru: Я прав!

# Apellate_Right_Hint
source: I answered right!
ru_ru: Я ответил верно

# Apellate_Wrong
source: I disagree!
ru_ru: Я против!

# Apellate_Wrong_Hint
source: Another player answered wrong
ru_ru: Другой ответил неверно

# AppLanguage
source: Application language
ru_ru: Язык приложения

source: Application
ru_ru: Приложение

# AppSettings
source: Application settings
ru_ru: Настройки приложения

# AppTheme
source: Theme
ru_ru: Тема

source: Ascending
ru_ru: по возрастанию

source: At
ru_ru: за

source: Authors
ru_ru: Авторы

source: Avatar...
ru_ru: Аватар…

# BaseCostForRandomPackage
source: Base cost of a question in a random pack
ru_ru: Базовая стоимость вопроса в случайном пакете

# BirthDate
source: Date of birth
ru_ru: Дата рождения

source: Bravery
ru_ru: Смелость

# CancelReady
source: Cancel readiness
ru_ru: Отмена готовности

# CatCost
source: Secret question cost
ru_ru: Стоимость Вопроса с секретом

source: Categories
ru_ru: Категории

source: Category
ru_ru: Категория

source: Characters per second
ru_ru: Cимволов в секунду

source: Clear
ru_ru: Очистить

source: Common
ru_ru: Общее

source: Connect
ru_ru: Подключиться

source: Continue
ru_ru: Продолжить

# Created
source: Is created
ru_ru: Создана

# CriticalQuestionsCount
source: Critical questions count for mobilization
ru_ru: Число вопросов в конце раунда для мобилизации

# CriticalSumPartition
source: Critical score partition for mobilization
ru_ru: % своей суммы от денег лидера для мобилизации

source: Default settings will be used
ru_ru: Будут использованы настройки по умолчанию.

source: Delete table
ru_ru: Удалить стол

source: Descending
ru_ru: по убыванию

# DenyPressWhileReading
source: You cannot press the button during question reading
ru_ru: Нельзя нажимать на кнопку до окончания чтения вопроса

source: Donate...
ru_ru: Поблагодарить автора…

source: English
ru_ru: Английский

source: Entrance
ru_ru: ВХОД В ИГРУ

# Error_DirectXBroken
source: Can't run the game. DirectX 9 is broken
ru_ru: Не удалось запустить игру, так как повреждена система отрисовки DirectX 9

# Error_FilesBroken
source: Can't run the game. Game files are broken
ru_ru: Не удалось запустить игру, так как файлы игры повреждены

# Error_IncifficientResources
source: Insufficient memory to run the program
ru_ru: Недостаточно памяти для запуска программы!

# Error_IncifficientResourcesForExecution
source: Insufficient memory to execute the program
ru_ru: Недостаточно памяти для выполнения программы!

# Error_NetBroken
source: Can't create the main window of the game. Your software environment seems to be broken. Try to reinstall .NET Framework 4
ru_ru: Не удалось создать главное окно игры! Похоже, на вашем компьютере повреждена среда выполнения программ. Попробуйте переустановить .NET Framework 4.

# Error_OSBroken
source: Your OS is broken. Can't run the game.
ru_ru: Обнаружено повреждение операционной системы. Запуск игры невозможен.

# Error_RuntimeBroken
source: Can't create the main window of the game. Your software environment seems to be broken.
ru_ru: Не удалось создать главное окно игры! Похоже, на вашем компьютере повреждена среда выполнения программ

# Error_SettingsLoading
source: An error occured while loading game settings
ru_ru: Ошибка при загрузке настроек программы

# Error_SettingsSaving
source: An error occured while saving game settings
ru_ru: Ошибка при сохранении настроек программы

# Error_WindowsAutomationBroken
source: Windows Automation error. Try to update your OS for .NET Framework 4 or install API Windows automation library (the link is on the game website). If it doesn't help, please, connect the author of the game.
ru_ru: Ошибка старта игры, связанная с Windows Automation. Попробуйте установить обновления для своей операционной системы, для .NET Framework 4 или установить библиотеку API Windows Automation (ссылка находится на странице игры). Если ничего не поможет, свяжитесь, пожалуйста, с автором игры.

source: Erudition
ru_ru: Эрудиция

source: Exit
ru_ru: Выход

# ExitPrompt
source: Do you really want to exit?
ru_ru: Действительно выйти?

# Exit_Button
source: Exit
ru_ru: Выйти

# FalseStart
source: False starts
ru_ru: Фальстарты

source: Feedback..
ru_ru: Замечания и предложения…

source: File...
ru_ru: Файл…

# ForceStartGame
source: START THE GAME
ru_ru: НАЧАТЬ ИГРУ

# ForceStartGame_Hint
source: Force the start
ru_ru: Начать, не дожидаясь готовности участников

# Forward
source: Next
ru_ru: Дальше (→)

source: Free
ru_ru: Освободить

# FullScreen
source: Fullscreen mode
ru_ru: Полноэкранный режим

source: Game button key
ru_ru: Клавиша игровой кнопки

# GameButton_Hint
source: Game button
ru_ru: Игровая кнопка

source: Game name
ru_ru: Название игры

source: Game rules
ru_ru: Правила игры

source: Game style
ru_ru: Стиль игры

source: game table
ru_ru: игровым столом

source: Game type
ru_ru: Тип игры

# GiveCatToWorst
source: Odds: give the Secret question to a player with the lowest score
ru_ru: Вероятность: отдать "Вопрос с секретом" тому, у кого меньше денег

source: Help...
ru_ru: Помощь…

# HintShowman
source: Show correct answers to the host beforehand
ru_ru: Сообщать ведущему правильные ответы заранее

source: Host
ru_ru: Хост

# LineHeight
source: Line height in questions
ru_ru: Межстрочный интервал в вопросе

# LocalNetworkOnly
source: To play in LAN
ru_ru: Для игры по локальной сети

source: Logic
ru_ru: Логика

# Logon
source: Login
ru_ru: ВОЙТИ

source: Logs...
ru_ru: Логи…

# Man
source: Male
ru_ru: мужчина

# Manage
source: Game
ru_ru: Игра

source: Managed game
ru_ru: Управляемая игра

# ManagedGame_Hint
source: The game continues only when you preess "Next"
ru_ru: Игра продолжается только по нажатию кнопки "Дальше"

source: Management
ru_ru: Управление

# Manage_Hint
source: Manage the game
ru_ru: Управление ходом игры

# MediaPort
source: Multimedia port
ru_ru: Порт изображений и мультимедиа-вопросов

source: Messages
ru_ru: Сообщения

source: Move...
ru_ru: Переместить…

source: Name
ru_ru: Имя

# NetworkGameHint
source: To creat a Network game you should play in LAN, have a real IP and set up NAT
ru_ru: Для создания сетевой игры нужно играть по локальной сети, иметь реальный IP или настроить NAT

source: NEW GAME
ru_ru: НОВАЯ ИГРА

source: Next
ru_ru: Следующий пакет

source: Next round
ru_ru: Следующий раунд

source: NO
ru_ru: НЕТ

source: No penalty for wrong answer
ru_ru: Не снимать очки за неверный ответ

source: Options
ru_ru: Опции

source: Oral game
ru_ru: Устная игра

# OralGame_Hint
source: If the host is a human. Good for streamers. Players make choice and give an oral answer
ru_ru: Если ведущий – человек. Хорошо подходит для стримов. Игроки делают выбор и дают ответ голосом

source: Other
ru_ru: Прочее

# Package
source: Pack
ru_ru: Пакет

source: Partial questions
ru_ru: Частичный вывод текста

# PartialQuestions_Hint
source: The text appears in portions if you play without false starts
ru_ru: При игре без фальстартов текст выводится порционно

# PassOnQuestion1
source: Odds: passing on a question of the first category
ru_ru: Вероятность: ПАС на вопросе 1 категории

# PassOnQuestion5
source: Odds: passing on a question of the fifth category
ru_ru: Вероятность: ПАС на вопросе 5 категории

source: Password
ru_ru: Пароль

source: Pause
ru_ru: Пауза

# Persons
source: Participants
ru_ru: Участники

source: Players
ru_ru: Игроки

# PlayerSum
source: Player's score
ru_ru: Сумма игрока:

source: Port number
ru_ru: Номер порта

source: Previous round
ru_ru: Предыдущий раунд

# PublishedDate
source: Publication date
ru_ru: Дата публикации

source: Publisher
ru_ru: Издатель

# QuestionLibrary
source: Questions library
ru_ru: Онлайн Библиотека вопросов

# QuestionPack
source: Questions pack
ru_ru: Пакет вопросов

# RandomRoundsCount
source: Rounds amount in a random pack
ru_ru: Число раундов в случайном пакете

# RandomServer
source: Random server themes set
ru_ru: Случайный набор тем сервера

# RandomSpecials
source: Random special questions
ru_ru: случайные спецвопросы

# RandomThemes
source: Random themes set
ru_ru: Случайный набор тем

# RandomThemesCount
source: Random pack themes count
ru_ru: Число тем в случайном пакете

source: Reaction speed
ru_ru: Скорость реакции

source: Reading speed
ru_ru: Скорость чтения вопроса

source: Ready
ru_ru: Готов

# ReplaceTo
source: Replace with
ru_ru: Заменить на

# ReportTitle
source: Your gaming experience
ru_ru: Ваши впечатления от игры

# Report_Info
source: The report contains information about the game results, appealed answers and your wrong answers. It helps to make the game better
ru_ru: Отчёт об игре содержит информацию об итогах игры, об апеллированных ответах и ваших неправильных версиях. Он позволяет сделать игру лучше

# RestartRequired
source: Restart is required
ru_ru: (требуется перезапуск)

source: Restriction
ru_ru: Ограничение

source: Result
ru_ru: Результат

source: Right answers
ru_ru: Верные ответы

# Rules
source: Game rules
ru_ru: Правила игры

# RunUpdate
source: Update
ru_ru: Обновить

source: Russian
ru_ru: Русский

# SeacrhForUpdates
source: Searching for updates
ru_ru: Поиск обновлений

source: Search
ru_ru: Поиск

source: Select
ru_ru: Выбрать

# SelectBackground
source: Select...
ru_ru: Выбрать…

# SelectionStyle
source: Question choice
ru_ru: Выбор вопроса

# Selection_CheapQuestion
source: Odds: the question is cheaper than the previous
ru_ru: Вероятность: вопрос дешевле, чем был

# Selection_ExpensiveQuestion
source: Odds: the question is more expensive than the previous
ru_ru: Вероятность: вопрос дороже, чем был

# Selection_KeepTheme
source: Odds: the theme is the same and the previous
ru_ru: Вероятность: тема останется той же, что и была

# Selection_PreferQuestionNumber
source: Question choice according to the number of the question
ru_ru: Выбор вопроса согласно номеру вопроса

# Selection_PreferTheme
source: Odds: question choice according to the theme number, not the question number
ru_ru: Вероятность: выбор вопроса согласно номеру темы, а не номеру вопроса

# Selection_PreferThemeNumber
source: Question choice according to the number of the theme
ru_ru: Выбор вопроса согласно номеру темы

# Selection_QuestionPriority
source: Question priority
ru_ru: Приоритет вопросов

# Selection_RandomQuestion
source: Odds: random question
ru_ru: Вероятность: случайный вопрос

# Selection_RandomTheme
source: Odds: random theme
ru_ru: Вероятность: случайная тема

# Selection_SamePriceQuestion
source: Odds: question of the same cost
ru_ru: Вероятность: вопрос той же цены

# Selection_ThemePriority
source: Theme priority
ru_ru: Приоритет тем

# Selection_UseQuestionPriority
source: Odds: questions according to priority
ru_ru: Вероятность: вопрос согласно приоритету

# Selection_UseThemePriority
source: Odds: a theme according to themes priority
ru_ru: Вероятность: тема согласно приоритету тем

source: Send
ru_ru: Отправить

# SendGameReport
source: Send game reports
ru_ru: Отправлять отчёт об игре

source: Server
ru_ru: Сервер

source: Settings management
ru_ru: Управление настройками

source: Sex
ru_ru: Пол

# ShowAnimations
source: Show 3D-animations on the table
ru_ru: 3D-анимации на табло

# ShowBorderOnFalseStart
source: Show the frame at the beginning of the question while playing without false starts
ru_ru: Показывать рамку в начале чтения вопроса при игре без фальстартов

source: Showman
ru_ru: Ведущий

source: Show more
ru_ru: Подробнее

source: Skip
ru_ru: Пропустить

# Sort
source: Sort by
ru_ru: Сортировка

source: Sound
ru_ru: Звук

# Stake
source: Bet
ru_ru: Ставка

# Started
source: Is started
ru_ru: Начата

# StartGame
source: Start the game
ru_ru: Создать комнату

source: Status
ru_ru: Статус

# StudiaBackground
source: Studio background
ru_ru: Фоновое изображение студии

# StudiaBackground_Hint
source: Works for all the participants
ru_ru: Действует для всех участников игры

# SumChange
source: Score change
ru_ru: Изменение суммы

# Sums
source: Score
ru_ru: Суммы

# Sums_Hint
source: Change scores of the players
ru_ru: Изменить суммы участников

# TableBackground
source: Table background color
ru_ru: Цвет фона табло

# TableColor
source: Table text color
ru_ru: Цвет текста табло

source: Table font
ru_ru: Шрифт табло

source: Time
ru_ru: Время

source: Time settings
ru_ru: Настройки времени

# Time_Decide
source: Time to make a decision
ru_ru: Время на принятие решения

# Time_Press
source: Time to press the button
ru_ru: Время на нажатие кнопки

# Time_Round
source: Round time
ru_ru: Время раунда

# TranslateToChat
source: Translate the game into the chat
ru_ru: Транслировать игру в чат

# TryReinstallApp
source: Try to reinstall the application
ru_ru: Попробуйте переустановить программу

# UI
source: User interface
ru_ru: Интерфейс

source: Update
ru_ru: Обновление

# UpdateException
source: The following exception occured while searching the update: {0}
ru_ru: При поиске обновления возникла следующая ошибка: {0}

# UserPackages
source: User packs
ru_ru: Пользовательские пакеты…

# Validate_IsTrue
source: Is the answer of the player correct?
ru_ru: Верен ли ответ игрока

source: Viewers
ru_ru: Зрители

# WelcomeToSIOnline
source: Welcome to SIGame Online!
ru_ru: Добро пожаловать в СИ Онлайн!

# Woman
source: Female
ru_ru: женщина

source: Write logs
ru_ru: Вести логи

source: Wrong answers
ru_ru: Неверные ответы

source: YES
ru_ru: ДА

source: Your answer
ru_ru: Ваш ответ

source: Volume control
ru_ru: Регулятор громкости

# GameModes_Sport
source: Simple
ru_ru: Упрощённая

# GameModes_Tv
source: Classic
ru_ru: Классическая

# GameRole_Player
source: Player
ru_ru: Игрок

# GameRole_Showman
source: Showman
ru_ru: Ведущий

# GameRole_Viewer
source: Viewer
ru_ru: Зритель

# NetworkGameType_DirectConnection
source: Direct connection
ru_ru: Локальная сеть

# NetworkGameType_NetworkGameServer
source: Internet
ru_ru: Интернет

# PlayerStyle_Agressive
source: Agressive
ru_ru: Агрессивный

# PlayerStyle_Careful
source: Careful
ru_ru: Осторожный

# PlayerStyle_Normal
source: Normal
ru_ru: Спокойный

# About_Design
source: Designer: Alexander Kuznetsov
ru_ru: Дизайнер: Александр Кузнецов

# About_Images
source: Images of participants are in the public domain and are taken from wikipedia.org
ru_ru: Изображения участников находятся в общественном достоянии и взяты с сайта wikipedia.org

# AccountTypes_Computer
source: Computer
ru_ru: Компьютер

# AccountTypes_Human
source: Human
ru_ru: Человек

source: (default)
ru_ru: (по умолчанию)

source: Login
ru_ru: НИКНЕЙМ

source: Main background
ru_ru: Основной фон

# Person_Change
source: Change
ru_ru: Изменить

# Person_Delete
source: Delete
ru_ru: Удалить

source: Role
ru_ru: Роль

# Tab_Chat
source: Chat
ru_ru: Чат

# Tab_Games
source: Games
ru_ru: Игры

# Tab_Players
source: Players
ru_ru: Игроки

# Sound_BeginRound
source: Begin round sound
ru_ru: Мелодия начала раунда

# Sound_FinalQuestion
source: Final question sound
ru_ru: Мелодия финального размышления

# Sound_MainMenu
source: Main menu sound
ru_ru: Мелодия главного меню

# Sound_NoAnswer
source: No answers sound
ru_ru: Мелодия отсутствия ответов

# Sound_NoRiskQuestion
source: No risk question sound
ru_ru: Мелодия вопроса для себя без риска

# Sound_RoundThemes
source: Round themes sound
ru_ru: Мелодия тем раунда

# Sound_SecretQuestion
source: Secret question sound
ru_ru: Мелодия вопроса с секретом

# Sound_StakeQuestion
source: Stake question sound
ru_ru: Мелодия вопроса со ставкой

source: Exit game
ru_ru: Выход из игры

# Filter_All
source: (all)
ru_ru: (все)

# Filter_NotSet
source: (not set)
ru_ru: (не задано)

# JumpList_Feedback
source: Feedback
ru_ru: Замечания

# JumpList_Feedback_Hint
source: Send your feedback to game author
ru_ru: Написать замечания автору игры

# JumpList_Help
source: Help
ru_ru: Помощь

# JumpList_Help_Hint
source: Open help file
ru_ru: Открыть файл помощи

# JumpList_Logs
source: Logs
ru_ru: Логи

# JumpList_Logs_Hint
source: Open logs folder
ru_ru: Открыть папку логов игры

# Settings_Default
source: Reset to default
ru_ru: По умолчанию

# Settings_Export
source: Export…
ru_ru: Экспорт…

# Settings_Import
source: Import…
ru_ru: Импорт…

# FileLarger1Mb
source: File is too large (over 1 Mb)!
ru_ru: Слишком большой файл (больше 1 Мб)!

# Images
source: Image
ru_ru: Изображения

# NETFrameworkCorrupted
source: App runtime is corrupted! Try reinstall .NET Framework 4.6.
ru_ru: Повреждена среда выполнения программы! Переустановите .NET Framework 4.6.

source: Select avatar
ru_ru: Выберите аватар

source: Select export filename
ru_ru: Выберите имя файла для экспорта

# SelectGameLogoFileName
source: Select game logo
ru_ru: Выберите файл логотипа игры

source: Select game package
ru_ru: Выберите игровой пакет

source: Select import filename
ru_ru: Выберите имя файла для импорта

# SelectLogsFolder
source: Select new logs folder
ru_ru: Выберите новую папку для хранения логов

# SelectMainBackgroundFIleName
source: Select main background
ru_ru: Выберите файл для главного фонового изображения

# SelectSoundFile
source: Select sound
ru_ru: Выберите мелодию

# SelectStudiaBackgroundFileName
source: Select studia background
ru_ru: Выберите файл для фонового изображения студии

# SIQuestions
source: SIGame questions
ru_ru: Вопросы SIGame

# SISettings
source: SIGame settings
ru_ru: Настройки SIGame

# SiteNavigationError
source: Error while navigating to site {0}. Be sure that you have default browser.
ru_ru: Возникла ошибка при переходе на сайт {0}. Убедитесь, что у вас настроен браузер по умолчанию.

source: Sounds
ru_ru: Мелодии

source: Ban
ru_ru: Забанить

source: Change to Computer
ru_ru: Изменить тип на Компьютер

source: Change to Human
ru_ru: Изменить тип на Человек

source: Join as player
ru_ru: Войти игроком

source: Join as showman
ru_ru: Войти ведущим

source: Join as viewer
ru_ru: Войти зрителем

source: Kick
ru_ru: Выгнать

source: Profile
ru_ru: Профиль

# Strength_High
source: Difficulty: high
ru_ru: Уровень сложности: высокий

# Strength_Low
source: Difficulty: low
ru_ru: Уровень сложности: низкий

# Strength_Middle
source: Difficulty: normal
ru_ru: Уровень сложности: средний

# XpsHelp
source: help
ru_ru: помощь

# HelpFile
source: Help_en.xps
ru_ru: Help_ru.pdf

source: Not set
ru_ru: Не задан

# LinkLogo
source: /SIGame;component/Resources/fb_logo.png
ru_ru: /SIGame;component/Resources/vk_logo.png

# Error_Typography
source: System fonts error. Cannot run the game
ru_ru: Ошибка с системными шрифтами. Запуск игры невозможен

# Sound_RoundTimeout
source: Round timeout sound
ru_ru: Мелодия окончания времени раунда

# AnswersAtBottom
source: Will appear at the bottom of the screen
ru_ru: Будут отображаться внизу экрана

source: Game management
ru_ru: Управление игрой

source: Close
ru_ru: Закрыть

# LoadExternalMedia
source: Load multimedia from external resources
ru_ru: Загружать мультимедиа со сторонних ресурсов

source: Pass
ru_ru: Пас

# RulesHint
source: Set oral game, false starts, partial question rendering and so on
ru_ru: Настроить игру голосом, фальстарты, частичный вывод вопросов и многое другое

source: Licenses
ru_ru: Лицензии

# About_Composer
source: Composer
ru_ru: Композитор

# MainPort
source: Main
ru_ru: Основной

# MultimediaPort
source: Multimedia
ru_ru: Мультимедиа

# TheseSettingsAreChangedBeforeGame
source: These settings are set before entering game room
ru_ru: Эти настройки задаются до входа в комнату игры

# ErrorDescribe
source: Please describe your actions at the time the error occurred
ru_ru: Опишите, пожалуйста, ваши действия в момент возникновения ошибки

# ErrorFixed
source: This error is fixed in the new version of the program. Please update.
ru_ru: Эта ошибка исправлена в новой версии программы. Обновитесь, пожалуйста.

# ErrorNET
source: An error occurred in the .NET Framework: {0}. Try installing operating system updates or reinstalling the .NET Framework.
ru_ru: Возникла ошибка в .NET Framework: {0}. Попробуйте установить обновления операционной системы или переустановить .NET Framework.

# ErrorNotReproduced
source: This error is not reproducible. If you can surely reproduce it, please contact the author.
ru_ru: Эта ошибка не воспроизводится. Если вы можете её гарантированно воспроизвести, свяжитесь с автором, пожалуйста.

# FatalErrorMessage
source: A fatal error has occurred in the application. The program will be closed. Do you want to send error information to the game author?
ru_ru: В приложении возникла неустранимая ошибка. Программа будет закрыта. Отправить информацию об ошибке автору?

# ReportDelayed
source: Cannot connect to server while sending error report. The report will be sent later
ru_ru: Не удалось подключиться к серверу при отправке отчёта об ошибке. Отчёт будет отправлен позднее.
