Repository: VladimirKhil/SI
Catalog: src/SIQuester/SIQuester/Properties/Resources.*.resx
Languages: ru_ru

# About
source: About the program…
ru_ru: О программе…

# Accept
source: Credit
ru_ru: Зачёт

source: Actions
ru_ru: Действия

source: Add
ru_ru: Добавить

source: Add answer
ru_ru: Добавить ответ

source: Add audio
ru_ru: Добавить аудио

source: Add complex answer
ru_ru: Добавить сложный ответ

source: Add empty question
ru_ru: Добавить пустой вопрос

source: Add HTML
ru_ru: Добавить HTML

source: Add image
ru_ru: Добавить изображение

# AddOption
source: Add answer option
ru_ru: Добавить вариант ответа

# AddOral
source: Add oral text
ru_ru: Добавить устный текст

source: Add parameter
ru_ru: Добавить параметр

# AddQuestion
source: Add question (Insert)
ru_ru: Добавить вопрос (Insert)

# AddRound
source: Add round (Insert)
ru_ru: Добавить раунд (Insert)

source: Add text
ru_ru: Добавить текст

# AddTheme
source: Add topic (Insert)
ru_ru: Добавить тему (Insert)

source: Add video
ru_ru: Добавить видео

source: Advanced
ru_ru: Дополнительно

# AlignAnswersRight
source: Align answers to the right edge of the window in the tree view
ru_ru: Выровнять ответы по правому краю окна в древовидном отображении

# AlignPriceWithQuestionText
source: The price is written in the same line as the question
ru_ru: Цена пишется в той же строке, что и вопрос

source: All files
ru_ru: Все файлы

source: Answer
ru_ru: Ответ

# AnswerHeader
source: Answer:
ru_ru: Ответ:

# AnswerMetaHint
source: Hint about metacharacters in answers
ru_ru: Подсказка про метасиволы в ответах

source: Answer options
ru_ru: Варианты ответа

source: Answers layout
ru_ru: Ответы пишутся

source: Answer type
ru_ru: Тип ответа

# AppAuthor
source: Vladimir Khil
ru_ru: Владимир Хиль

# AppLanguage
source: App language (restart required)
ru_ru: Язык приложения (требуется перезапуск)

# ApplicationIsClosing
source: Closing the Application object
ru_ru: Идет завершение работы объекта Application

# AppRunError
source: Program start error
ru_ru: Ошибка запуска программы

# AppTitle
source: SIGame question editor
ru_ru: Редактор вопросов SIGame

# AppWillBeClosed
source: The program will be closed. If this error occurs again, contact the developer
ru_ru: Программа будет закрыта. При повторном возникновении этой ошибки обратитесь к разработчику

source: Attach package…
ru_ru: Присоединить пакет…

# AttachPackageHint
source: Attaching another question file
ru_ru: Присоединение другого файла вопросов

source: Audio
ru_ru: Аудио

source: Author
ru_ru: Автор

source: Authors
ru_ru: Авторы

# AuthorsAbsence
source: No authors
ru_ru: Отсутствие авторов

# AuthorsHeader
source: Authors:
ru_ru: Авторы:

source: Authors layout
ru_ru: Авторы пишутся

source: Auto-detect
ru_ru: Автоопределение

# AutoDetectTemplateWhenImportingText
source: Automatic template selection when importing text
ru_ru: Автоматический подбор шаблона при импорте текста

# AutomaticallyDetectTemplates
source: Define input file templates automatically
ru_ru: Определить шаблоны входного файла автоматически

# AutoSave
source: Auto-save (application restart required)
ru_ru: Автосохранение (требуется перезапуск приложения)

# AutoSetQuestionPrices
source: Automatic setting of question costs
ru_ru: Автоматическое задание стоимостей вопросов

# BagCat_Knows
source: Theme and prices are announced
ru_ru: Тема и стоимость известны

# BagCat_Knows_Value_After
source: After giving
ru_ru: После отдачи

# BagCat_Knows_Value_Before
source: Before giving
ru_ru: До отдачи

# BagCat_Knows_Value_Never
source: Never
ru_ru: Никогда

# BagCat_Self
source: Can give to yourself
ru_ru: Отдать себе

# BagCat_Self_Value_False
source: Disallow
ru_ru: Нельзя

# BagCat_Self_Value_True
source: Allow
ru_ru: Можно

# BaseAuthors
source: Author
ru_ru: Автор

source: Base question price
ru_ru: Базовая стоимость вопроса

# BaseSources
source: Source
ru_ru: Источник

source: Base value
ru_ru: Базовое значение

source: Basic settings
ru_ru: Основные настройки

# BindingDetachedError
source: It is impossible to perform this operation when the binding is disconnected
ru_ru: Невозможно выполнить эту операцию, когда привязка отсоединена

# BracketsContentToComment
source: Move brackets content to comment
ru_ru: Содержимое внутри скобок вынести в комментарий

# ByDefault
source: Reset to default
ru_ru: По умолчанию

# Bytes
source: byte
ru_ru: байт

source: Cancel
ru_ru: Отмена

source: Cancel search
ru_ru: Отменить поиск

source: Championship
ru_ru: Чемпионат

source: Change language
ru_ru: Поменять язык

# CheckFileSize
source: Check that the question file is suitable for playing through the Game server
ru_ru: Проверять, что файл вопросов подходит для игры через Игровой сервер

source: City
ru_ru: Город

# ClearType
source: Remove type
ru_ru: Удалить тип

source: Clone question
ru_ru: Клонировать вопрос

source: Clone round
ru_ru: Клонировать раунд

# CloneTheme
source: Clone topic
ru_ru: Клонировать тему

source: Close
ru_ru: Закрыть

# CollapseAll
source: Expand all
ru_ru: Развернуть всё

source: Collapse all media
ru_ru: Свернуть всё медиа

source: Collapse media
ru_ru: Свернуть медиа

source: Comment
ru_ru: Комментарий

source: Comments
ru_ru: Комментарии

# CommentsHeader
source: Comments:
ru_ru: Комментарии:

# Common
source: Normal
ru_ru: Обычный

# CommonAppError
source: Program execution error
ru_ru: Ошибка выполнения программы

# ContactAuthor
source: Write remarks to the author…
ru_ru: Написать замечания автору…

# ContactAuthorToolTip
source: Report bugs to the author or make suggestions
ru_ru: Сообщить автору о багах или что-нибудь предложить

# ContactUri
source: Contact address
ru_ru: Адрес для связи

# ConvertToCompSI
source: Format for TV and Comp-SIGame
ru_ru: Оформить для Теле- и Комп-SIGame

# ConvertToCompSIHint
source: Split into rounds and assign television costs
ru_ru: Разбить по раундам и назначить телевизионные стоимости

# ConvertToCompSISimple
source: Correct for TV and Comp-SIGame
ru_ru: Поправить для Теле- и Комп-SIGame

# ConvertToCompSISimpleHint
source: Change topic names, remove dots at the end of questions
ru_ru: Изменить названия тем, убрать точки в конце вопросов

# ConvertToMillionaire
source: Format for "Millionaire"
ru_ru: Оформить для "Миллионера"

# ConvertToMillionaireHint
source: Split into groups of 15 questions
ru_ru: Разбить на группы по 15 вопросов

# ConvertToSportSI
source: Format for Sport-SIGame
ru_ru: Оформить для Спорт-SIGame

# ConvertToSportSIHint
source: Assign costs of 10, 20, 30, etc.
ru_ru: Назначить стоимости 10, 20, 30 и т.д.

source: Copy
ru_ru: Копировать

source: Country
ru_ru: Страна

source: Create
ru_ru: Создать

# Create5QuestionsWithTheme
source: Create 5 questions along with theme
ru_ru: Создавать 5 вопросов вместе с темой

source: Creation date
ru_ru: Дата создания

source: Custom themes
ru_ru: Точечная выборка

source: Cut
ru_ru: Вырезать

source: Delete
ru_ru: Удалить

source: Difficulty
ru_ru: Сложность

# DocumentCaption
source: Document title
ru_ru: Заголовок документа

source: Document font
ru_ru: Шрифт документа

# Donate
source: Thank the author…
ru_ru: Поблагодарить автора…

# DuplicateAnd
source: A and B => A and B + B and A
ru_ru: A и B => A и B + B и A

source: Duration
ru_ru: Длительность

source: Edit
ru_ru: Редактировать

source: Edit mode
ru_ru: Способ редактирования

# EditModeFixedPanel
source: Fixed panel
ru_ru: Фиксированная панель

# EditModeFloatPanel
source: Floating panel
ru_ru: Плавающая панель

# EditModeNone
source: Read only
ru_ru: Только чтение

# EditMode_FixedPanel
source: Fixed panel
ru_ru: Фиксированная панель

# EditMode_FloatPanel
source: Floating panel
ru_ru: Плавающая панель

# EditMode_ReadOnly
source: Read only
ru_ru: Только чтение

source: Edit text
ru_ru: Редактировать текст

# Empty
source: Untitled
ru_ru: Без имени

# EmptyLineBeforeThemeName
source: Is an empty line needed after the theme name
ru_ru: Нужна ли пустая строка после темы

# EmptyQuestion
source: (empty)
ru_ru: (пустой)

source: Encoding
ru_ru: Кодировка

# ExpandAll
source: Collapse all
ru_ru: Свернуть всё

source: Expand all media
ru_ru: Развернуть всё медиа

source: Expand media
ru_ru: Развернуть медиа

source: Export
ru_ru: Экспорт

source: Export and print
ru_ru: Экспорт и печать

# ExportFormatsDb
source: Questions database
ru_ru: База вопросов

# ExportFormatsDinabank
source: Dinabank
ru_ru: Динабанк

# ExportMediaCommand
source: Unload media…
ru_ru: Выгрузить медиа…

# FileExistReplace
source: File {0} exists, replace it?
ru_ru: Файл {0} существует, заменить?

# FileImport
source: Import file
ru_ru: Импорт файла

# FillPrices
source: Set costs
ru_ru: Задать стоимости

source: Filter
ru_ru: Фильтр

source: Final
ru_ru: Финал

source: Final round
ru_ru: Финальный раунд

source: Final theme count
ru_ru: Число тем в финале

# FlatLayoutModeHeader
source: Placement of elements in tile mode
ru_ru: Расположение элементов в режиме плиток

# FlatLayoutModeList
source: List
ru_ru: Список

# FlatLayoutModeTable
source: Table
ru_ru: Таблица

# FormattedHtml
source: Customizable HTML
ru_ru: Настраиваемый HTML

# FormattedHtmlHint
source: Ability to configure a specific package view
ru_ru: Возможность настройки специфического представления пакета

source: from
ru_ru: от

# FullUpdates
source: Program update to version {0} detected. Additional installation will be performed. Install the update now?
ru_ru: Обнаружено обновление программы до версии {0}. Будет произведена дополнительная установка. Установить обновление сейчас?

source: Help
ru_ru: Помощь

# HowToUse
source: How to use the program…
ru_ru: Как использовать программу…

# HtmlExportHint
source: Set the parameters of the output document and press the "Export" button
ru_ru: Настройте параметры выходного документа и нажмите кнопку "Экспорт"

source: Images
ru_ru: Изображения

source: Import
ru_ru: Импорт

# ImportDB
source: Question database…
ru_ru: База вопросов…

# ImportSIStorage
source: Question library…
ru_ru: Библиотека вопросов…

# ImportText
source: Text…
ru_ru: Текст…

# ImportTextTip
source: Convert text file to SIQ format
ru_ru: Преобразование текстового файла в SIQ формат

# ImportXml
source: XML file…
ru_ru: XML-файл…

# Increase
source: Increment
ru_ru: Приращение

source: Install updates
ru_ru: Устанавливать обновления

# InstallUpdatesHint
source: The program will automatically check for updates on the developer's website and install them
ru_ru: Программа будет автоматически проверять наличие обновлений на сайте разработчика и устанавливать их

# InvalidParameter
source: Parameter is set incorrectly
ru_ru: Параметр задан неверно

# JoinWithNext
source: Merge with the next one (play simultaneously)
ru_ru: Объединить со следующим (играть одновременно)

source: Language
ru_ru: Язык

source: Last word to new answer
ru_ru: Последнее слово в новый ответ

# Licences
source: Licenses
ru_ru: Лицензии

source: List
ru_ru: Список

source: Make empty
ru_ru: Сделать пустым

source: Make non-empty
ru_ru: Сделать непустым

source: mIRC Script
ru_ru: Скрипт mIRC

# MircScriptHint
source: Conducting a game in IRC
ru_ru: Проведение игры в IRC

source: Move down
ru_ru: Переместить ниже

source: Move left
ru_ru: Переместить левее

source: Move right
ru_ru: Переместить правее

source: Move up
ru_ru: Переместить выше

source: Name
ru_ru: Имя

source: Next
ru_ru: Дальше

source: Next fragment
ru_ru: Следующий фрагмент

# NextSearchResult
source: Next result
ru_ru: Следующий результат

source: No
ru_ru: Нет

# NonStandardPackageParameters
source: Custom package settings
ru_ru: Параметры нестандартного пакета

# NotEnoughMemoryToStartApp
source: Not enough memory to run the program!
ru_ru: Недостаточно памяти для выполнения программы!

# NumberSetModeFixedValue
source: Fixed value
ru_ru: Фиксированное значение

# NumberSetModeMinimumOrMaximumInRound
source: Minimum or maximum in round
ru_ru: Минимум или максимум в раунде

# NumberSetModeRange
source: Select
ru_ru: Выбор

# NumberSetModeRangeWithStep
source: Select with step
ru_ru: Выбор с шагом

# NumberThemes
source: Number the themes
ru_ru: Нумеровать темы

source: Object
ru_ru: Объект

# OfficialSite
source: Official website
ru_ru: Официальный сайт

# Open
source: Open… (Ctrl+O)
ru_ru: Открыть… (Ctrl+O)

# OpenCloseBracketsIncosistency
source: Mismatch of the number of opening and closing brackets
ru_ru: Несоответствие числа открывающих и закрывающих скобок

source: Open file after saving
ru_ru: Открыть файл после сохранения

source: Open package
ru_ru: Открыть пакет

source: Open recent
ru_ru: Открыть недавние

source: or
ru_ru: или

# OrientationHorizontal
source: rows
ru_ru: в строку

# OrientationVertical
source: columns
ru_ru: в столбец

source: Package author
ru_ru: Автор пакета

source: Package logo
ru_ru: Логотип пакета

source: Package name
ru_ru: Имя пакета

source: Package name font size
ru_ru: Размер шрифта в имени пакета

# PackageType
source: Package template
ru_ru: Шаблон пакета

# Paste
source: Insert
ru_ru: Вставить

# PlayQuestion
source: Start question
ru_ru: Запустить вопрос

source: Previous fragment
ru_ru: Предыдущий фрагмент

# PreviousSearchResult
source: Previous result
ru_ru: Предыдущий результат

# Price
source: Cost
ru_ru: Стоимость

source: Print...
ru_ru: Печать...

# PrintedHtml
source: HTML for printing
ru_ru: HTML для печати

source: Publisher
ru_ru: Издатель

# PublisherCompany
source: Publisher
ru_ru: Издательство

# PublishersAll
source: (all)
ru_ru: (все)

# PublishersNotSet
source: (not set)
ru_ru: (не задано)

source: Question
ru_ru: Вопрос

# QuestionParsing
source: Import questions
ru_ru: Импорт вопросов

# QuestionSplitting
source: Splitting text into questions
ru_ru: Разделение текста на вопросы

source: Question text font size
ru_ru: Размер шрифта в вопросе

source: Question type
ru_ru: Тип вопроса

source: Range
ru_ru: Интервал

source: Recent files
ru_ru: Последние файлы

# Redo
source: Repeat
ru_ru: Повторить

source: Refresh
ru_ru: Обновить

source: Remove answer
ru_ru: Удалить ответ

source: Remove complex answer
ru_ru: Удалить сложный ответ

source: Remove link
ru_ru: Удалить ссылку

source: Remove logo
ru_ru: Удалить логотип

source: Remove parameter
ru_ru: Удалить параметр

source: Remove question
ru_ru: Удалить вопрос

source: Remove round
ru_ru: Удалить раунд

# RemoveTemplate
source: Delete template
ru_ru: Удалить шаблон

# RemoveTheme
source: Remove topic
ru_ru: Удалить тему

source: Remove unused files
ru_ru: Удалить неиспользуемые файлы

# RemoveUnusedMedia
source: Remove multimedia from the package when the last link to it is deleted
ru_ru: Удалять мультимедиа из пакета при удалении последней ссылки на него

source: Reserve
ru_ru: Резерв

source: Restriction
ru_ru: Ограничение

source: Round count
ru_ru: Число раундов

source: Round name font size
ru_ru: Размер шрифта в названии раунда

# RoundThemeCount
source: Theme per round count
ru_ru: Число тем в раунде

source: Save
ru_ru: Сохранить

# SaveAll
source: Save all (Shift+Ctrl+S)
ru_ru: Сохранить всё (Shift+Ctrl+S)

source: Save and export
ru_ru: Сохранение и экспорт

source: Save as…
ru_ru: Сохранить как…

source: Save as template…
ru_ru: Сохранить как шаблон…

source: Scale
ru_ru: Масштаб

source: Search
ru_ru: Поиск

# SearchFolder
source: Folder to search...
ru_ru: Папка для поиска...

source: Search results
ru_ru: Результаты поиска

source: Search text
ru_ru: Искать текст

source: Second name
ru_ru: Отчество

# SecretCanBeGivenToSelf
source: Question can be given to yourself
ru_ru: Вопрос можно оставить себе

# SecretNoQuestion
source: Price is accrued without question
ru_ru: Сумма начисляется без вопроса

# SecretPublicPrice
source: Theme and cost are announced before question is given
ru_ru: Тема и стоимость оглашаются до передачи

source: Select
ru_ru: Выбрать

# SelectedToNewAnswer
source: Selected -> New answer
ru_ru: Выделенное -> Новый ответ

# SelectedToNewComment
source: Selected -> New comment
ru_ru: Выделенное -> Новый комментарий

# SelectedToNewSource
source: Selected -> New source
ru_ru: Выделенное -> Новый источник

source: Select file…
ru_ru: Выбрать файл…

# SelectionMode
source: Transfer mode
ru_ru: Режим передачи

# SelectOptionCount
source: Default option count
ru_ru: Число вариантов ответа по умолчанию

# SelectSearchFolder
source: Select a folder to search
ru_ru: Выберите папку для поиска

source: Select themes…
ru_ru: Выбрать темы…

# SelectThemesHint
source: Save part of the topics of this package into a separate package
ru_ru: Сохранить часть тем данного пакета в отдельный пакет

# SendErrorHeader
source: Serious application failure. Send a report to the author? (if possible, contact the author personally, as there are only extremely rare errors left in the program)
ru_ru: Серьёзный сбой в приложении. Отправить отчёт автору? (по возможности, свяжитесь с автором лично, так как в программе остались только крайне редкие ошибки)

# SendToPCGame
source: Send to computer game
ru_ru: Отправить в компьютерную игру

# SetAnswererSelect_Any
source: To anyone
ru_ru: Кому угодно

# SetAnswererSelect_ExceptCurrent
source: To everyone except oneself
ru_ru: Всем кроме себя

# SetAnswerTypeType_Select
source: Select from options
ru_ru: Выбор из вариантов

# SetAnswerTypeType_Text
source: Text
ru_ru: Текст

source: Set logo
ru_ru: Задать логотип

source: Set tags
ru_ru: Задать теги

# SetTime
source: Specify time interval
ru_ru: Указать временной интервал

source: Settings
ru_ru: Настройки

# SettingsSavingError
source: Error saving settings
ru_ru: Ошибка сохранения настроек

# ShowToolTipsInFlatView
source: Show tooltips in tile view
ru_ru: Показывать всплывающие подсказки в плиточном отображении

# ShuffleQuestions
source: Shuffle questions and costs
ru_ru: Перемешать вопросы и стоимости

source: Side panel
ru_ru: Боковая панель

source: SI questions
ru_ru: Вопросы СИ

source: Size
ru_ru: Размер

source: Skip fragment
ru_ru: Пропустить фрагмент

# SnsTemplatesHint
source: Use SNS project templates
ru_ru: Использовать шаблоны проекта СНС

# SortQuestionsByPrice
source: Sort questions by cost
ru_ru: Отсортировать вопросы по стоимости

source: Source
ru_ru: Источник

source: Source file
ru_ru: Исходный файл

source: Source fragment
ru_ru: Исходный фрагмент

source: Sources
ru_ru: Источники

# SourcesAbsense
source: No sources
ru_ru: Отсутствие источников

# SourcesHeader
source: Sources:
ru_ru: Источники:

source: Sources layout
ru_ru: Авторы пишутся

# SpellChecking
source: Spell check (Windows 8.1 and above)
ru_ru: Проверка правописания (Windows 8.1 и выше)

# StandardLogicDescription
source: The answer immediately follows the question
ru_ru: Ответ следует сразу после вопроса

# StandardLogicHint
source: Expect that each question is immediately followed by an answer, rather than first reading a group of questions and then a group of answers
ru_ru: Ожидать, что за каждым вопросом немедленно идёт ответ, а не считывать сначала группу вопросов, а затем группу ответов

source: Standard value
ru_ru: Стандартное значение

source: Start
ru_ru: Старт

source: Start import
ru_ru: Начать импорт

# SubfolderSearch
source: Search in subfolders
ru_ru: Искать в подпапках

source: Surname
ru_ru: Фамилия

source: Table
ru_ru: Таблица

source: Table format
ru_ru: Табличный формат

source: Tags
ru_ru: Теги

source: Template
ru_ru: Шаблон

source: Text before theme name
ru_ru: Текст перед темой

# TextToImport
source: Text for import (copy into the field below or open a file)
ru_ru: Текст для импорта (скопируйте в поле ниже или откройте файл)

source: Theme
ru_ru: Тема

source: Theme name font size
ru_ru: Размер шрифта в названии темы

# ThemeQuestionCount
source: Question per theme count
ru_ru: Число вопросов в теме

source: Title
ru_ru: Название

source: to
ru_ru: до

# ToggleToOralAndBack
source: Change type (to oral or back)
ru_ru: Поменять тип (на устный или обратно)

# ToolTipFileSearch
source: File search
ru_ru: Поиск файлов

# ToolTipNew
source: New… (Ctrl+N)
ru_ru: Новый… (Ctrl+N)

# TotalThemes
source: Theme count:
ru_ru: Всего тем:

source: Tour
ru_ru: Тур

source: Type
ru_ru: Тип

# Undo
source: Cancel
ru_ru: Отменить

# UnlinkFromNext
source: Disconnect from the next one
ru_ru: Отсоединить от следующего

# UpdateException
source: The following error occurred while searching for an update: {0}
ru_ru: При поиске обновления возникла следующая ошибка: {0}

# UpdatePricesOnDragAndDrop
source: Change question costs when dragging
ru_ru: Изменять стоимости вопросов при перетаскивании

# UpdatePricesOnDragAndDropHint
source: Questions will be moved, but the cost distribution will remain the same
ru_ru: Вопросы будут перемещаться, а распределение стоимостей останется прежним

source: Version
ru_ru: Версия

source: Video
ru_ru: Видео

source: View
ru_ru: Представление

# ViewModeFlat
source: Tiles
ru_ru: Плитки

# ViewModeTree
source: Tree
ru_ru: Дерево

source: Wikify
ru_ru: Викифицировать

# WikifyHint
source: Insert typographic quotes, ellipsis, and dash
ru_ru: Вставить типографские кавычки, многоточие и тире

# WindowsAutomationError
source: Application startup error related to Windows Automation. Try installing updates for your operating system, for .NET Framework 4, or install the Windows Automation API library (the link is on the application page).
ru_ru: Ошибка старта приложения, связанная с Windows Automation. Попробуйте установить обновления для своей операционной системы, для .NET Framework 4 или установить библиотеку API Windows Automation (ссылка находится на странице приложения).

# WithStep
source: with a step
ru_ru: с шагом

# WrongAnswers
source: Incorrect answers
ru_ru: Неправильные ответы

# WrongMultimediaAddress
source: Incorrect multimedia address. The program terminated abnormally with an error
ru_ru: Некорректный адрес мультимедиа. Программа аварийно завершена с ошибкой

source: Year
ru_ru: Год

# Years
source: yrs.
ru_ru: гг.

# YourThemes
source: Your topics:
ru_ru: Ваши темы:
