Repository: VladimirKhil/SI
Catalog: src/SIGame/SIGame.ViewModel/Properties/Resources.*.resx
Languages: ru_ru

# About_Version
source: Version
ru_ru: Версия

# AlreadyExists
source: A player with such name already exists
ru_ru: Участник с таким именем уже существует!

source: Any
ru_ru: Любой

# BadPackage
source: This pack can't be used to play on the server
ru_ru: Данный пакет не может быть использован для игры на сервере!

# BirthDateRequired
source: You have to set your date of birth
ru_ru: Необходимо задать дату рождения!

# ChangeAccount
source: Account change
ru_ru: Изменение аккаунта

# CommentSiteError
source: An error occured while visiting the web-site to comment. Make sure you have a default browser
ru_ru: Ошибка при переходе на сайт для комментирования. Убедитесь, что у вас настроен браузер по умолчанию.

source: Create
ru_ru: Создать

# CreatedGameNotFound
source: Can't fine a created game
ru_ru: Не удалось обнаружить созданную игру!

# Creating
source: Creating the game...
ru_ru: Создание игры…

# DeleteConfirm
source: Are you sure you want to remore the player '{0}'?
ru_ru: Вы действительно хотите удалить участника '{0}'?

# ErrorMovingToSite
source: An error occured while visiting the site {0}. Make sure you have a system default browser selected.
ru_ru: Возникла ошибка при переходе на сайт {0}. Убедитесь, что у вас настроен браузер по умолчанию.

# ExportOk
source: Export successfully completed
ru_ru: Экспорт успешно выполнен!

# FileTooLarge
source: The file it too large
ru_ru: Слишком большой файл!

# GameClosedCauseEverybodyLeft
source: Game closed due to the players disconnect
ru_ru: Сервер завершил игру из-за отключения участников

source: Game connection timeout
ru_ru: Истекло ожидание подключения к серверу

# GameCreationError_BadPackage
source: Bad pack
ru_ru: Плохой пакет вопросов!

# GameCreationError_DuplicateName
source: A game with such name already exists
ru_ru: Игра с таким именем уже существует!

# GameCreationError_NoPackage
source: Can't create a game on the server due to absence of a pack
ru_ru: Не удалось создать игру на сервере, так как не был обнаружен игровой пакет!

# GameCreationError_ObsoleteVersion
source: Your client is outdated. Please, update the game.
ru_ru: Ваша версия игры устарела. Обновите игру

# GameCreationError_ServerError
source: Can't create a game on the server due to an error
ru_ru: Не удалось создать игру на сервере из-за ошибки на сервере!

# GameCreationError_ServerMaintainance
source: The server is in the maintenance. Please, try to log in later. We apologize for any inconvenience caused
ru_ru: Производится обслуживание сервера! Пожалуйста, подключитесь через некоторое время. Приносим извинения за доставленные неудобства.

# GameCreationError_ServerNotReady
source: The server is not ready to start the game
ru_ru: Сервер не готов начать игру

# GameCreationError_TooManyGames
source: The maximal amount of games in the server is exceeded. Please, wait.
ru_ru: Превышено максимальное количество запущенных игр на сервере! Пожалуйста, подождите.

# GameCreationError_UnknownReason
source: Can't creat a game due to an unknown error
ru_ru: Не удалось создать игру по неизвестной причине!

source: Game engine error
ru_ru: Ошибка игрового движка

# GameEntering
source: Entering the game...
ru_ru: Вход в игру…

# GameNameRequired
source: Game name is required
ru_ru: Необходимо задать название игры

# GamesFilter_All
source: All
ru_ru: Все

# GamesFilter_New
source: New
ru_ru: Новые

# GamesFilter_NoPassword
source: No password
ru_ru: Без пароля

# GamesFilter_Sport
source: Sport
ru_ru: Упрощённые

# GamesFilter_Tv
source: TV
ru_ru: Классические

# ImportOk
source: Import successfully completed
ru_ru: Импорт успешно выполнен!

# IsDouble
source: {0} is found at least twice
ru_ru: {0} встречается как минимум дважды!

# LinkError
source: An error occured while trying to follow the link. Please, make sure you have a default browser
ru_ru: Ошибка при переходе по ссылке. Убедитесь, что у вас настроен браузер по умолчанию.

# LoginForbidden
source: This login is forbidden on the server
ru_ru: На сервере запрещено использование такого логина!

# LogsMovingError
source: An error occured while moving logs
ru_ru: Не удалось перенести логи

# LostConnection
source: The connection is lost
ru_ru: Соединение с сервером разорвано!

# MainMenu_About
source: About
ru_ru: Об игре

# MainMenu_BestPlayers
source: Best players
ru_ru: Лучшие игроки

# MainMenu_Exit
source: Exit
ru_ru: Выход

# MainMenu_NetworkGame
source: Local game
ru_ru: Локальная игра

# MainMenu_OnlineGame
source: Online game
ru_ru: Игра онлайн

# MainMenu_SingleGame
source: Single game
ru_ru: Одиночная игра

# NameRequired
source: Player's name is required
ru_ru: Необходимо указать имя участника!

source: New
ru_ru: Новый

source: New account
ru_ru: Новый аккаунт

source: New game
ru_ru: Новая игра

# NewPlayer
source: New AI player
ru_ru: Новый компьютерный игрок

source: New Showman
ru_ru: Новый ведущий

# NoLogsFolder
source: Log folder not found
ru_ru: Папка логов не существует!

# OnlineUserConflict
source: A user with such name is already on the server
ru_ru: Пользователь с таким именем уже вошёл на сервер!

# OpenLogsError
source: Log folder opening error: {0}
ru_ru: Ошибка при открытии папки логов: {0}

# PackageCheck
source: Checking the pack...
ru_ru: Проверка пакета…

# PlayerDeleteConfirm
source: Do you really want to remove the AI player {0}?
ru_ru: Вы действительно хотите удалить компьютерного игрока {0}?

# PlayerExists
source: The player already exists
ru_ru: Такой игрок уже есть!

# PlayerNameRequired
source: The player's name is required
ru_ru: Игроку необходимо задать имя!

# PortNumberRequired
source: The port number is required
ru_ru: Необходимо задать номер порта

source: Preparing...
ru_ru: Подготовка…

source: Rejoin error
ru_ru: Соединение было установлено, но внезапно разорвалось!

source: Save
ru_ru: Сохранить

# SendingPackageToServer
source: Sending the pack to the server
ru_ru: Отправка пакета на сервер…

# SettingsReset
source: The settings are set to default
ru_ru: Настройки возвращены к значениям по умолчанию!

# ShomanNameRequired
source: Showman's name is required
ru_ru: Ведущему необходимо задать имя!

# ShowmanDeleteConfirm
source: Do you really want to remove the showman {0}?
ru_ru: Вы действительно хотите удалить ведущего {0}?

# SIStorage
source: Questions storage
ru_ru: Библиотека вопросов

# SIStorageCallError
source: An error while accessing the storage
ru_ru: Ошибка обращения к Библиотеке

# SIStorageError
source: An error while working the storage
ru_ru: Ошибка работы с Библиотекой вопросов

# SiteNavigationError
source: An error occured while following the web-site ({0}). Make sure you have a default browser
ru_ru: Возникла ошибка при переходе на сайт ({0}). Убедитесь, что у вас настроен браузер по умолчанию.

# TimeSettings_ChoosingFinalTheme
source: Сhoosing a final round theme
ru_ru: Выбор темы в финальном раунде

# TimeSettings_ChoosingQuestion
source: Choosing a question
ru_ru: Выбор вопроса

# TimeSettings_FinalThinking
source: Thinking on final question
ru_ru: Обдумывание в финале

# TimeSettings_GivingCat
source: Giving the "Secret question"
ru_ru: Размышление на отдачу "Вопроса с секретом"

# TimeSettings_MakingStake
source: Making a bet in an "Stake question" and in a final question
ru_ru: Размышление над ставкой в "Вопросе со ставкой" и в финале

# TimeSettings_PrintingAnswer
source: Entering the answer after pressing the button
ru_ru: Ввод ответа после нажатия кнопки

# TimeSettings_Round
source: Round
ru_ru: Раунд

# TimeSettings_ShowmanDecisions
source: Making decisions and accepting answers by showman
ru_ru: Принятие ответов и решений ведущим

# TimeSettings_ThinkingOnQuestion
source: Thinking on a question
ru_ru: Размышление над вопросом

# TimeSettings_ThinkingOnSpecial
source: Thinking on a special question
ru_ru: Размышление над спецвопросом

# UploadPackageTimeout
source: The pack sending time is expired. Please, try again, or reduce the size of the file
ru_ru: Истекло время ожидания отправки пакета. Попробуйте ещё раз или уменьшите размер файла.

# WrongAddressFormat
source: Invalid address format
ru_ru: Неверный формат адреса

source: Computer player
ru_ru: Компьютерный игрок

# VKThemesError
source: An error occured while following the web-site ({0}). Make sure you have a default browser
ru_ru: Возникла ошибка при переходе на сайт ({0}). Убедитесь, что у вас настроен браузер по умолчанию.

# GameStage_Created
source: Created
ru_ru: Создана

# GameStage_Final
source: Final
ru_ru: Финал

# GameStage_Finished
source: Finished
ru_ru: Игра окончена

# GameStage_Round
source: Round
ru_ru: Раунд

# GameStage_Started
source: Started
ru_ru: Начата

# Online_Login_Hint
source: Try to disable firewall or antivirus. Maybe the problem is with VPN or proxy server
ru_ru: Попробуйте отключить брандмауэр или файервол. Возможно, дело в VPN или прокси-сервере

source: Next
ru_ru: Следующий

# RandomThemes
source: Random themes set
ru_ru: Случайный набор тем

# Error_SendingReport
source: Cannot connect to server while uploading game report. The report will be sent later
ru_ru: Не удалось подключиться к серверу при отправке отчёта об игре. Отчёт будет отправлен позднее.

# Error_UploadingAvatar
source: Cannot upload avatar to address
ru_ru: Не удалось загрузить аватар по адресу

# GameModes_Sport_Hint
source: Questions are played sequentially
ru_ru: Вопросы играются по очереди

# GameModes_Tv_Hint
source: Questions are selected by players
ru_ru: Вопросы выбираются игроками

# OnlineGameAddress
source: Game address
ru_ru: Адрес игры

source: Random server themes
ru_ru: Случайный набор тем сервера

# GameCreationError_JoinError
source: Game join error
ru_ru: Ошибка подключения

# GameCreationError_WrongSettings
source: Wrong game settings
ru_ru: Неверные настройки игры

# TimeSettings_MediaDelay
source: Pause while showing media
ru_ru: Пауза для медиаконтента

# TimeSettings_RightAnswer
source: Showing right answer
ru_ru: Вывод правильного ответа

# ServerConnectionError
source: Server connection lost!
ru_ru: Соединение с сервером потеряно!

source: Mixed
ru_ru: Разные

# RoundThemes
source: The round themes are; Here are the themes of the round
ru_ru: Темы раунда

# RoundTrailing
source: Round {0}
ru_ru: {0}-й раунд

source: News
ru_ru: Новости

# ReconnectedMessage
source: Connection restored.
ru_ru: Соединение восстановлено.

source: package not selected
ru_ru: пакет не выбран

# NoLicensesFolder
source: Licenses folder not found
ru_ru: Папка лицензий не существует!

# OpenLicensesError
source: Licenses folder opening error
ru_ru: Ошибка при открытии папки лицензий: {0}

# GameRule_IgnoreWrong
source: ignore wrong
ru_ru: право на ошибку

# GameRule_NoFalseStart
source: no falstarts
ru_ru: без фальстартов

# GameRule_Oral
source: oral
ru_ru: устная

# GameRule_Sport
source: simplified
ru_ru: упрощённая

# UpdateVersionMessage
source: Game update to version {0} found
ru_ru: Обнаружено обновление программы до версии {0}

# PortIsUsedError
source: Multimedia port {0} is alreay used (another game running?). Try to set another port in settings
ru_ru: Мультимедиа-порт {0} уже занят (возможно, одна игра уже запущена?). Попробуйте задать другой порт в настройках

# TooManyGames
source: You have created too many games!
ru_ru: Вы создали слишком много игр!

# MaximumFileSize
source: Maximum file size: {0} MB
ru_ru: Максимальный размер файла: {0} МБ

# AvatarTooBig
source: Your avatar is bigger than 1 MB. Other players will not see it
ru_ru: Ваш аватар по размеру превышает 1 Мб и не будет виден другим участникам!

source: Invalid avatar data
ru_ru: Неверные данные аватара

# GameRule_Classic
source: classic
ru_ru: классическая

source: Cannot join game
ru_ru: Не удалось войти в игру

# GameRule_PingPenalty
source: ping penalty
ru_ru: штраф за пинг

# YouNeedToUpgradeClientToJoinGame
source: You need to upgrade application to join this game
ru_ru: Необходимо обновить приложение для входа в эту игру

# CommonJoinError
source: Common error
ru_ru: Ошибка общего вида

source: Game not found
ru_ru: Игра не найдена

source: Internal server error
ru_ru: Внутренняя ошибка сервера

source: Invalid role
ru_ru: Неверная роль

# JoinForbidden
source: Forbidden to join (you are banned)
ru_ru: Вам запрещён вход в эту игру

source: Unknown error
ru_ru: Неизвестная ошибка

# TooMuchRandomPackages
source: You created too much random pakages. Please try again later
ru_ru: Вы создали слишком много случайных пакетов. Попробуйте ещё раз позже

# QuestionLibrary
source: Online question library
ru_ru: Онлайн Библиотека вопросов

# SetVideoAvatar
source: Set video avatar (vdo.ninja)
ru_ru: Задать видео аватар (vdo.ninja)

# TimeSettings_PartialImageTime
source: Partial image display
ru_ru: Вывод частичных изображений

# HintSelectPlayerForSumChange
source: Select a player to change his score
ru_ru: Выберите игрока для изменения суммы

# HintChangeSum
source: Change the sum
ru_ru: Измените сумму

# HintSelectActivePlayer
source: Select new active player
ru_ru: Выберите, кому передать ход

# CannotKickBots
source: You can't kick bots
ru_ru: Компьютерных участников нельзя выгнать!

# CannotKickYouself
source: You can't kick yourself
ru_ru: Себя выгнать нельзя!

# CannotBanBots
source: You can't ban bots
ru_ru: Компьютерных участников нельзя забанить!

# CannotBanYourself
source: You can't ban yourself
ru_ru: Себя забанить нельзя!

# CannotSetHostToBot
source: Cannot set bot as host
ru_ru: Ботов нельзя сделать хостом

# CannotSetHostToYourself
source: Your are host already!
ru_ru: Вы уже хост!

source: Cannot connect to server
ru_ru: Не удалось подключиться к серверу

# NetworkOpeningError
source: Error while starting listening network: {0}. Network connections are unavailable.
ru_ru: Ошибка при открытии сетевого подключения: {0}. Сетевые подключения невозможны.

# QuestionTypeForAll
source: Question for all
ru_ru: Вопрос для всех

# QuestionTypeStakeForAll
source: Question for all with stake
ru_ru: Вопрос для всех со ставкой

# QuestionTypeWithButton
source: Question with button
ru_ru: Вопрос с кнопкой

# GameClosedMessage
source: Game closed by server due to inactivity
ru_ru: Игра завершена сервером по причине неактивности

# ReportTip
source: Your comment about game and questions:
ru_ru: Ваш комментарий об игре и вопросах:

# ReportTitle
source: Game report
ru_ru: Содержимое отчёта об игре

# HintSelectCatPlayer
source: Select a player to give the question to
ru_ru: Выберите игрока, которому вы отдаёте вопрос

# HintSelectStarter
source: Select a player who is starting the round
ru_ru: Выберите начинающего раунд

# HintThemeDeleter
source: Select the player who is removing the theme
ru_ru: Выберите убирающего тему

# HintSelectStaker
source: Select a player who is making a bet
ru_ru: Выберите ставящего

# HintSelectTheme
source: Remove a theme on the board
ru_ru: Уберите тему на табло

# HintSelectQuestion
source: Select a question on the board
ru_ru: Выберите вопрос на табло

# HintCheckAnswer
source: Define if the answer is correct
ru_ru: Определите правильность ответа игрока

# ErrorWritingLogToDisc
source: Error while writing log to disc
ru_ru: Ошибка записи лога на дискs

# Label_Auction
source: QUESTION WITH A STAKE
ru_ru: ВОПРОС СО СТАВКОЙ

# Label_CatInBag
source: QUESTION WITH A SECRET
ru_ru: ВОПРОС С СЕКРЕТОМ

# Label_Sponsored
source: QUESTION FOR YOURSELF WITHOUT RISK
ru_ru: ВОПРОС ДЛЯ СЕБЯ

# GameStarted
source: The game has started
ru_ru: Игра началась

# Hint
source: Hint: you can press the answer button at any point of the screen using right mouse button or {0} key
ru_ru: Подсказка: игровую кнопку можно нажимать в любой точке окна при помощи правой кнопки мыши или клавиши {0}.

# PressButton
source: Please, press the button right after the frame around the board appears
ru_ru: Старайтесь жать на кнопку сразу после загорания рамки на экране, пожалуйста

# HintMakeAStake
source: Make a stake
ru_ru: Сделайте ставку
