Repository: VladimirKhil/SI
Catalog: src/SImulator/SImulator.ViewModel/Properties/Resources.*.resx
Languages: ru_ru

source: Add
ru_ru: Добавить

# ButtonPressed
source: Button press
ru_ru: Нажатие на кнопку

# ConnectionError
source: Connection error: {0}
ru_ru: Ошибка связи: {0}

source: Error
ru_ru: Ошибка

# FinalThemeRemoval
source: Deleting theme in the final round
ru_ru: Удаление темы в финале

# FinalThink
source: Final round thinking
ru_ru: Размышление в финале

# GameEndingError
source: Game end error: {0}
ru_ru: Ошибка завершения игры: {0}

# GameEndsBecauseOfConnectionLoss
source: Connection to the demonstration computer has been terminated. The game is stopped.
ru_ru: Соединение с демонстрационным компьютером было разорвано. Игра прекращена.

# GamePackageLoadError
source: Error loading game package
ru_ru: Ошибка при загрузке игрового пакета

source: Game start
ru_ru: Начало игры

# GameStartError
source: Game start error: {0}
ru_ru: Ошибка старта игры: {0}

source: Game themes
ru_ru: Темы игры

# IpAddressHint
source: [Your IP address]
ru_ru: [Ваш IP-адрес]

# LoggerCreationWarning
source: Log file creation error: {0}. Logging will not be performed.
ru_ru: Ошибка создания файла лога: {0}. Лог записываться не будет

# LoggerInitError
source: Error starting log recording
ru_ru: Ошибка старта записи лога

# LogsFolderNotSetWarning
source: Log directory is not specified. Logs will not be recorded.
ru_ru: Папка для записи логов не задана! Логи вестись не будут

source: Next
ru_ru: Дальше

source: No answer
ru_ru: Нет ответа

# NoLicensesFolder
source: License folder not found
ru_ru: Папка лицензий не найдена!

# NoRiskQuestion
source: Question for yourself without risk
ru_ru: Вопрос для себя без риска

# OpenLicensesError
source: Error opening license folder: {0}
ru_ru: Ошибка при открытии папки лицензий: {0}

source: Package authors
ru_ru: Авторы пакета

source: Package comments
ru_ru: Комментарии пакета

source: Package preparation error
ru_ru: Ошибка подготовки пакета

source: Pause
ru_ru: Приостановить

source: Press the button
ru_ru: Нажмите на кнопку

source: Question selection
ru_ru: Выбор вопроса

# QuestionTypeForAll
source: Question For All
ru_ru: Вопрос для всех

# QuestionTypeSecret
source: Question with Secret
ru_ru: Вопрос с секретом

# QuestionTypeSimple
source: Question with Button
ru_ru: Вопрос с кнопкой

# QuestionTypeStake
source: Question with Stake
ru_ru: Вопрос со ставкой

# QuestionTypeStakeForAll
source: Question For All with Stake
ru_ru: Вопрос для всех со ставкой

# RightAnswer
source: Correct answer
ru_ru: Правильный ответ

source: Round
ru_ru: Раунд

source: Round start
ru_ru: Начало раунда

source: Round themes
ru_ru: Темы раунда

# RoundTimeout
source: Round time has expired.
ru_ru: Время раунда вышло.

# Run
source: Start
ru_ru: Запустить

source: Score
ru_ru: Счёт

source: Secret question
ru_ru: Вопрос с секретом

source: Select audio file
ru_ru: Выберите аудиофайл

source: Select background image
ru_ru: Выберите изображение-фон

# SelectBackgroundVideo
source: Select background video file
ru_ru: Выберите видеофайл-фон

# SelectIntroVideo
source: Select splash video file
ru_ru: Выберите заставочный видеофайл

# SelectLogoImage
source: Select splash image
ru_ru: Выберите изображение-заставку

source: Stake question
ru_ru: Вопрос со ставкой

source: Start game
ru_ru: Начать игру

source: Theme
ru_ru: Тема

source: Wrong answer
ru_ru: Неверный ответ
