Repository: VladimirKhil/SI
Catalog: src/SICore/SICore/Properties/Resources.*.resx
Languages: sr, uz

# AllQuestions
source: All the questions are taken; So, we are done with all the question
sr: Sva pitanja su odigrana; Dakle, odigrali smo sva pitanja

# AllTime
source: The time of the round has run out
sr: Vreme runde je isteklo; Vreme je isteklo

# Bravo
source: Bravo!!!;Excellent!!!;Absolutely right!!!;That's right, congratulation!!!;You have given the correct answer!!!; You're absolutely right!
sr: Bravo!!!;Odlično!!!;Apsolutno tačno!!!;Upravo tako, čestitam!!!;Dali ste apsolutno tačan odgovor!!!;Apsolutno ste u pravu!!!

# DeleteTheme
source: Remove a theme you don't like;remove one of the themes, please
sr: Molim vas, uklonite temu koja vam se ne sviđa; molim vas, uklonite jednu od tema

# EasyCat
source: There's no question here! The money was just added to your score! Congratulations!
sr: Nema nikakog pitanja! Novac se jednostavno prebacuje na vaš račun. Čestitamo!

source: From
sr: od

source: Game rules
sr: Pravila igre
uz: O‘yin qoidalari

source: I don't know
sr: Ne znam

# InformChooser
source: {0} will start the game; {0} is starting the game
sr: {0} će započeti igru; {0} započinje igru
uz: O‘yin {0} dan keyin boshlanadi;O‘yin boshlanishiga qoldi: {0}

# LetsSee
source: So, let's look at the players' answers;It's time to look at our players' answers
sr: Dakle, pogledajmo odgovore igrača; Vreme je da pogledamo odgovore naših igrača
uz: Xo‘sh, keling, o‘yinchilarning javoblari bilan tanishib chiqamiz;O‘yinchilar nima deb javob berganini bilish vaqti keldi

# MakeStake
source: Dear players, make your bets, please;Ladies and gentlemen, make your bets, please
sr: Dragi igrači, molimo vas da postavite svoje opklade; Gospodo, molimo vas da postavite svoje opklade
uz: Hurmatli o‘yinchilar, iltimos, o‘z badallaringizni tiking;Janoblar, marhamat, badal tiking

# MinMaxChoice
source: The minimum and the maximum in the round (your choice)
sr: Minimum ili maksimum po rundi (opciono)

# NowPlays
source: So, the player is
sr: Dakle, igra
uz: Shunday qilib, quyidagilar o‘ynamoqda

# OfPackage
source: of the pack
sr: paketa
uz: paketning

# OfTheme
source: of the theme
sr: teme

source: or
sr: ili

# PAuthors
source: Authors
sr: Autori

source: Restrictions
sr: Ograničenja
uz: Cheklovlar

# Right
source: Right!;You're right!;Yes, that's correct!;Yes!;Absolutely right!;That's it!;Of course!;For sure!;No doubt!; That's it!;Yes, you're correct!;You have given the correct answer!;Correct!
sr: Tačno!;U pravu ste!;Da, tako je!;Da!;Apsolutno tačno!;Upravo tako!;Naravno!;Naravno!;Pa, u osnovi, da!;Da, tako je;Dali ste tačan odgovor!;Apsolutno tačno!;U principu, u pravu ste

# Stake
source: Bet
sr: Ulog od
uz: Badal

# StartThink
source: Think!
sr: Razmisli!
uz: O‘ylang!

# ThankYou
source: Thank you! Pay attention to the board!
sr: Hvala! Pažnja, pitanje!
uz: Rahmat sizga! Diqqat, savol!

source: Theme
sr: Tema
uz: Mavzu

# TypeManaged
source: managable
sr: kontrolisana
uz: boshqariladigan

# TypeNoFalseStart
source: no false starts
sr: bez falstarta
uz: falstartsiz

# TypeOral
source: oral
sr: oralna
uz: og‘zaki

# TypeSport
source: simple
sr: pojednostavljena
uz: soddalashtirilgan

source: with
sr: za
uz: uchun

# WithStepOf
source: with step
sr: u koracima od

# Wrong
source: None of a kind!;Incorrect!;I'm sorry, but that's not correct;Unfortunately that's not right;You have given an incorrect answer!;That's not right!;No;No, you're mistaken!;No, you're not right! Your answer is not correct
sr: Oh, šta to govoriš!;Pogrešno!;Avaj, to nije istina!;Ne, grešiš;Nažalost, grešiš;Dao si pogrešan odgovor!;Pogrešno;Ne;Ne, grešiš;Ne, grešiš;Ne, ne!;Tvoj odgovor je netačan
uz: Yo‘g‘-e!;Noto‘g‘ri!;Afsuski, unday emas!;Yo‘q, noto‘g‘ri;Afsuski, adashdingiz;Siz noto‘g‘ri javob berdingiz!;Unday emas;Yo‘q;Yo‘q, siz adashdingiz;Yo‘g‘-e, nimalar deyapsiz;Yo‘q-yo‘q!;Javobingiz noto‘g‘ri

source: you can say only
sr: možeš samo reći
uz: siz faqat quyidagini ayta olasiz

# YourChoice
source: on the choice
sr: na izboru

# YouWin
source: Congratulations, you're the winner!; My congratulations!; Congratulations on the victory!
sr: Čestitam, pobedili ste!;Primite moje čestitke!;Čestitam vam na pobedi!
uz: tabriklayman, siz g‘alaba qozondingiz!;tabriklarimni qabul qiling!;g‘alaba muborak!

# GoodLuck
source: Thank you for your attention. We wish you good luck, see you soon, good bye!
uz: Barchaga e’tibor uchun rahmat. Xayr, ko‘rishguncha, sog‘ bo‘ling!

# YourStake
source: what's your bet?;make your bet
uz: sizning badalingiz?
