Repository: VladimirKhil/SI
Catalog: src/SImulator/SImulator/Properties/Resources.*.resx
Languages: ru_ru

source: About
ru_ru: О программе

source: Add player
ru_ru: Добавить игрока

source: Address to connect
ru_ru: Адрес для подключения

source: Add sum
ru_ru: Добавить сумму

# AddSumForActivePlayer
source: Add to active player
ru_ru: Добавить активному игроку

source: Alias
ru_ru: Псевдоним

source: (all)
ru_ru: (все)

source: Answer
ru_ru: Ответ

# AnswererBackgroundColor
source: Background color for the answering player
ru_ru: Цвет фона отвечающего игрока

source: Answer options
ru_ru: Варианты ответа

# AppLanguage
source: Application language (requires restart)
ru_ru: Язык приложения (требуется перезапуск)

# AppName
source: SImulator
ru_ru: СИмулятор

source: Audio
ru_ru: Аудио

source: Author
ru_ru: Автор

# AuthorName
source: Vladimir Khil
ru_ru: Владимир Хиль

# AutomaticGame
source: Automatic game management (without a host)
ru_ru: Автоматическое ведение игры (без ведущего)

source: Back
ru_ru: Назад

source: Background color
ru_ru: Цвет фона

source: Background image
ru_ru: Изображение-фон

# BackgroundVideo
source: Background video file
ru_ru: Видеофайл-фон

# ButtonBlockingTime
source: Button lock time (s)
ru_ru: Время блокировки кнопки (с)

# ButtonOrderHint
source: Matches positions of players in the list
ru_ru: Соответствуют позициям игроков в списке

source: Buttons
ru_ru: Кнопки

# ButtonTypesCom
source: COM port
ru_ru: COM-порт

# ButtonTypesExternal
source: External
ru_ru: Внешние

# ButtonTypesJoystick
source: Joystick
ru_ru: Джойстик

# ButtonTypesKeyboard
source: Keyboard
ru_ru: Клавиатура

# ButtonTypesNone
source: Do not use
ru_ru: Не использовать

# ButtonTypesWeb
source: Web access
ru_ru: Веб-доступ

# ByDefault
source: Default
ru_ru: По умолчанию

source: characters per second
ru_ru: символов в секунду

# ChoosePlayerToAnswer
source: Select a player to answer
ru_ru: Выберите игрока для ответа

# ChoosePlayerToStart
source: Select a player to start the game
ru_ru: Выберите игрока, начинающего игру

source: Clear list
ru_ru: Очистить список

source: Comment
ru_ru: Комментарий

# CommonAppError
source: An error occurred in the application: {0}\r\n\r\nThe application will be closed. Please contact the developer.
ru_ru: Произошла ошибка в приложении: {0}\r\n\r\nПриложение будет закрыто. Обратитесь к разработчику.

# ComponentsLicenses
source: Licenses of used components
ru_ru: Лицензии используемых компонентов

source: COM port number
ru_ru: Номер COM-порта

# Default
source: (by default)
ru_ru: (по умолчанию)

source: Delete
ru_ru: Удалить

source: Design
ru_ru: Внешний вид

# DiskFullError
source: Disk space is running out
ru_ru: Закончилось место на диске

# DropStatsOnBack
source: Rollback statistics when stepping back
ru_ru: Откатывать статистику при шаге назад

# DropStatsOnBackHint
source: Clear players sums and counters of their correct and incorrect answers
ru_ru: Возвращать суммы игроков и число их верных и неверных ответов

# EndQuestionOnRightAnswer
source: End the question on correct answer
ru_ru: Завершать вопрос при правильном ответе

# ErrorCannotReproduce
source: This error is not reproducible. If you can reliably reproduce it, please contact the author.
ru_ru: Эта ошибка не воспроизводится. Если вы можете её гарантированно воспроизвести, свяжитесь с автором, пожалуйста

# ErrorConnectionError
source: Failed to connect to the server when sending the error report. The report will be sent later.
ru_ru: Не удалось подключиться к серверу при отправке отчёта об ошибке. Отчёт будет отправлен позднее

# ErrorFixed
source: This error has been fixed in the new version of the program. Please update.
ru_ru: Эта ошибка исправлена в новой версии программы. Обновитесь, пожалуйста

# ErrorSendConfirm
source: An error occurred in the application: {0} The application will be closed. Send information to the developer?
ru_ru: Произошла ошибка в приложении: {0} Приложение будет закрыто. Отправить информацию разработчику?

# ExternalButtonsHint
source: In this mode, buttons not connected to the program (independent devices, claps, etc.) are used. The program displays a frame when it is possible to press (during the game with false starts).
ru_ru: В данном режиме используются кнопки, не подключённые к программе (независимые устройства, хлопки и т.д.). Программа показывает рамку в момент, когда можно нажимать (при игре с фальстартами)

# FalseStartGame
source: Game with false starts
ru_ru: Игра с фальстартами

# FalseStartGameHint
source: When playing with false starts: question text is displayed on the screen; when using buttons to start the question timer, an additional press of the Next button is required, and a colored frame lights up on the screen"
ru_ru: При игре с фальстартами: - на экране отображается текст вопросов; - при использовании кнопок для старта таймера вопроса требуется дополнительное нажатие на кнопку "Дальше", на экране при этом загорается цветная рамка

# FalseStartMultimedia
source: Multimedia with false starts
ru_ru: Мультимедиа с фальстартами

# FalseStartMultimediaHint
source: Prevents pressing the button during multimedia file playback
ru_ru: Запрещает нажимать на кнопку в процессе проигрывания мультимедиа-файла

# FileDeletionError
source: Error deleting file: {0}
ru_ru: Ошибка удаления файла: {0}

# FinalThinkingTime
source: Final round thinking time (s)
ru_ru: Время на размышление в финале (с)

# FinishGameQuestion
source: Finish game?
ru_ru: Завершить игру?

# FontFamily
source: Font
ru_ru: Шрифт

source: Game
ru_ru: Игра

source: Game buttons
ru_ru: Игровые кнопки

# GameModes_Sport
source: Simplified
ru_ru: Упрощённая

# GameModes_Tv
source: Classic
ru_ru: Классическая

source: Game package
ru_ru: Игровой пакет

source: Game rules
ru_ru: Правила игры

source: Game type
ru_ru: Тип игры

# GiveTurn
source: Pass the turn
ru_ru: Передать ход

source: Grid color
ru_ru: Цвет сетки

source: Hide
ru_ru: Скрыть

# HintBeforeStart
source: Press the "Next" button to control the game progress
ru_ru: Для управления ходом игры нажимайте кнопку "Дальше"

# HintGameThemes
source: (Game themes)
ru_ru: (Темы игры)

# HintIntro
source: (Splash screen)
ru_ru: (Заставка)

source: Image
ru_ru: Изображение

# IntroVideo
source: Splash video file
ru_ru: Заставочный видеофайл

# KeyboardDetachError
source: Error completing keyboard listening
ru_ru: Ошибка завершения прослушивания клавиатуры

# KeyboardListeningError
source: Error listening to the keyboard
ru_ru: Ошибка прослушивания клавиатуры

source: License
ru_ru: Лицензия

# LicenseText
source: All exclusive copyrights to the Software Product and its documentation in print and/or electronic form belong to the Author. The program is distributed free of charge. The User has the right to freely use and distribute this Program, place it on websites, and carry out other activities not prohibited by the legislation of their country of operation with it for any period of time, provided that the copyrights are preserved. The program is provided "as is". The Author does not provide any guarantees that the operation of the Program will meet the User's expectations. The Author is not obligated to fix the Program if such non-compliance occurs. The Author is not responsible for any damage caused by the use of this Program. By installing and using the Program, you automatically accept this Agreement. You may transfer the rights to use the Program to a third party subject to their agreement to this Agreement. If you do not agree with any term of this Agreement, you do not have the right to use this Program.
ru_ru: Все исключительные авторские права на Программный продукт и документацию к нему в печатном и/или электронном виде принадлежат Автору. Программа распространяется бесплатно. Пользователь имеет право свободно использовать и распространять данную Программу, размещать её на сайтах и производить другие не запрещённые законодательством его страны действия с ней в течение сколь угодно длительного времени при условии сохранения авторских прав. Программа поставляется «как есть». Автор не даёт никаких гарантий, что работа Программы будет соответствовать ожиданиям Пользователя. Автор не обязан исправлять Программу при возникновении данного несоответствия. Автор не несёт ответственности за ущерб, причинённый использованием данной Программы. Устанавливая и используя Программу, вы автоматически принимаете данное Соглашение. Вы можете передать права на использование Программы третьему лицу при условии его согласия с данным Соглашением. Если вы не согласны с каким-либо условием данного Соглашения, вы не имеете права использовать данную Программу.

# LogsFolderNotFound
source: The folder for logging "{0}" was not found.
ru_ru: Папка для записи логов "{0}" не найдена

# MainScreen
source: Main
ru_ru: Основной

source: Make stake
ru_ru: Сделать ставку

source: Name
ru_ru: Название

# NavigateToSiteError
source: An error occurred while navigating to the program website ({0}). Make sure you have your default browser configured: {1}
ru_ru: Возникла ошибка при переходе на сайт программы ({0}). Убедитесь, что у вас настроен браузер по умолчанию: {1}

source: Next
ru_ru: Дальше

source: Not selected
ru_ru: Не выбран

source: (not set)
ru_ru: (не задано)

source: old version
ru_ru: предыдущая версия

source: Oral
ru_ru: Устный текст

# OutOfMemoryError
source: Not enough memory to run the program
ru_ru: Недостаточно памяти для выполнения программы

source: Pass
ru_ru: Пас

source: Pause
ru_ru: Приостановить

# PlacementBackground
source: Background
ru_ru: Фон

# PlacementOral
source: Replica
ru_ru: Реплика

source: Play content
ru_ru: Играть элемент

source: Players
ru_ru: Игроки

# PlayersTable
source: Player table
ru_ru: Таблица игроков

source: Play sounds
ru_ru: Играть звуки

# PlaySpecials
source: Play special questions
ru_ru: Играть спецвопросы

# PresentationExitHint
source: To exit, press Escape, right mouse button, or tap slightly with your finger
ru_ru: Для выхода нажмите Escape, правую кнопку мыши или немного надавите пальцем

# PresentationTitle
source: Game table
ru_ru: Игровое табло

# PressButton
source: Press the button
ru_ru: Нажмите кнопку

# PreviewImage
source: Background image
ru_ru: Изображение-заставка

source: Previous round
ru_ru: Предыдущий раунд

source: Price
ru_ru: Стоимость

# PriceFromToStep
source: From {0} to {1} with step {2}
ru_ru: От {0} до {1} с шагом {2}

# PriceMinMaxRound
source: Minimum or maximum in the round
ru_ru: Минимум или максимум в раунде

# PriceOr
source: {0} or {1}
ru_ru: {0} или {1}

source: Question
ru_ru: Вопрос

source: Question library
ru_ru: Библиотека вопросов

# QuestionLineSpacing
source: Line spacing in question
ru_ru: Межстрочный интервал в вопросе

source: Question reading speed
ru_ru: Скорость чтения вопроса

# QuestionTime
source: Button press time (s)
ru_ru: Время на нажатие кнопки (c)

# QuestionTypeSecretNoQuestion
source: Secret question (money without question)
ru_ru: Вопрос с секретом (деньги без вопроса)

# QuestionTypeSecretPublicPrice
source: Secret question (theme and price known before passing the question)
ru_ru: Вопрос с секретом (тема и стоимость известны до передачи вопроса)

# QuestionTypeSimple
source: Simple
ru_ru: Простой

source: Recent files
ru_ru: Последние файлы

# RemovePlayer
source: Delete player
ru_ru: Удалить игрока

# ResetSums
source: Delete sums and statistics
ru_ru: Удалить суммы и статистику

source: Restriction
ru_ru: Ограничение

# RightAnswers
source: Correct
ru_ru: Верных

source: Round
ru_ru: Раунд

# RoundTime
source: Round time (s)
ru_ru: Время раунда (с)

source: Round timeout
ru_ru: Окончание времени раунда

# RuntimeBrokenError
source: Failed to create the main window of the program. It seems that the runtime environment of the program on your computer is corrupted: {0}
ru_ru: Не удалось создать главное окно программы. Похоже, на вашем компьютере повреждена среда выполнения программ: {0}

source: Save logs to folder
ru_ru: Сохранять логи в папку

# SavingSettingsError
source: Error saving program settings
ru_ru: Ошибка при сохранении настроек программы

source: Screen
ru_ru: Экран

# SecondaryScreen
source: Additional
ru_ru: Дополнительный

source: Select
ru_ru: Выбрать

# SelectAny
source: Anyone
ru_ru: Кому угодно

# SelectAnyExceptCurrent
source: Anyone except yourself
ru_ru: Кому угодно, кроме себя

# SelectFile
source: File…
ru_ru: Файл…

# SelectHeader
source: Select…
ru_ru: Выбрать…

# SelectionMode
source: Can be given to
ru_ru: Можно отдать

# SelectLibrary
source: Question library…
ru_ru: Библиотека вопросов…

# SelectLogsFolder
source: Select a folder to save logs
ru_ru: Выберите папку для записи логов

source: Select Package
ru_ru: Выбрать пакет

source: Select question package
ru_ru: Выберите пакет вопросов

# SeparateWindow
source: In separate window
ru_ru: В отдельном окне

# SetButton
source: Assign a button
ru_ru: Задать кнопку

source: Show
ru_ru: Показать

# ShowLostButtonPlayers
source: Show players who lost the button
ru_ru: Показывать игроков, проигравших кнопку

# ShowPlayersList
source: Show player list
ru_ru: Показывать список игроков

source: Show QR code
ru_ru: Показать QR код

# ShowQuestionBorder
source: Show frame when the button can be pressed
ru_ru: Показывать рамку в момент, когда можно нажимать на кнопку

# ShowRightAnswers
source: Show correct answers
ru_ru: Показывать правильные ответы

# ShowTableCaption
source: Show title on the game scoreboard
ru_ru: Показывать заголовок на игровом табло

# ShowTextNoFalseStartsHint
source: Show text of questions during game without false starts
ru_ru: Показывать текст вопросов при игре без фальстартов

# SignalsAfterTimerHint
source: Accept player signals after thinking time expires
ru_ru: Принимать сигналы игроков после истечения времени на размышление

source: SI questions
ru_ru: Вопросы СИ

# SIStorageError
source: Error working with question library: {0}
ru_ru: Ошибка работы с библиотекой вопросов: {0}

source: Sounds
ru_ru: Звуки

source: Source
ru_ru: Источник

source: Special questions aliases
ru_ru: Псевдонимы спецвопросов

# SpecialThinkingTime
source: Thinking time for special question (s)
ru_ru: Время на размышление над спецвопросом (с)

source: Stake
ru_ru: Ставка

source: Start
ru_ru: Старт

# StartGame
source: Start
ru_ru: Начать игру

# Stop
source: End
ru_ru: Завершить

# StopGame
source: End game
ru_ru: Завершить игру

# SubstractOnWrong
source: Deduct points for wrong answer
ru_ru: Снимать очки за неверный ответ

# SubtractSum
source: Subtract amount
ru_ru: Вычесть сумму

# SubtractSumForActivePlayer
source: Remove from active player
ru_ru: Удалить у активного игрока

source: Sum
ru_ru: Сумма

# TableHotKeysHint
source: Game table hotkeys: Space (left mouse button) - proceed Backspace - go back Escape (right mouse button) - end game
ru_ru: Горячие клавиши игрового табло: Пробел (левая кнопка мыши) - перейти дальше Backspace - перейти назад Escape (правая кнопка мыши) - завершить игру

source: Test package
ru_ru: Пакет тест

source: Text color
ru_ru: Цвет текста

source: Theme
ru_ru: Тема

source: Theme comments
ru_ru: Комментарии темы

source: Thinking
ru_ru: Размышление

# ThinkingTime
source: Thinking time after button press (s)
ru_ru: Время на размышление после нажатия кнопки (с)

source: Unknown type
ru_ru: Неизвестный тип

# UseKeysToSelectQuestions
source: Use keyboard selection on scoreboard
ru_ru: Использовать клавиатурный выбор на табло

# UseKeysToSelectQuestionsHint
source: Allows selecting questions on the scoreboard using two consecutive presses of the number buttons (theme number, question number/Escape to cancel) and removing themes in the final round with one press
ru_ru: Позволяет выбирать вопросы на табло при помощи двух последовательных нажатий на цифровые кнопки (номер темы, номер вопроса/Escape для отмены) и убирать темы в финале при помощи одного нажатия

source: Version
ru_ru: Версия

source: Video
ru_ru: Видео

# WebButtonsConnectionString
source: Connection address for game: http://
ru_ru: Адрес для подключения к игре: http://

# WebButtonsHint
source: In this mode, mobile devices of participants (phones, tablets, etc.) are used as buttons. Before the game starts, these devices are registered and associated with players. To play, you need to organize a local network.
ru_ru: В данном режиме в качестве кнопок используются мобильные устройства участников (телефоны, планшеты и пр.). Перед началом игры производится регистрация этих устройств и их связывание с игроками. Для игры необходимо организовать локальную сеть

# WebButtonsPort
source: Web access port
ru_ru: Порт веб-доступа

source: Website
ru_ru: Сайт

# WebView
source: Window
ru_ru: Окно

# Window
source: Window (old version)
ru_ru: Окно (предыдущая версия)

# WrongAnswers
source: Incorrect
ru_ru: Неверных
