Repository: VladimirKhil/SI
Catalog: src/SIQuester/SIQuester.ViewModel/Properties/Resources.*.resx
Languages: ru_ru

# About
source: About the program
ru_ru: О программе

# Accept
source: Credit
ru_ru: Зачёт

# AddQuestion
source: Add a question
ru_ru: Добавить вопрос

# AddRound
source: Add a round
ru_ru: Добавить раунд

# AddTheme
source: Add a theme
ru_ru: Добавить тему

source: and
ru_ru: и

source: Answer
ru_ru: Ответ

source: API key not set
ru_ru: Не задан ключ API

source: Audio
ru_ru: Аудио

# AudioIsNotOnBackground
source: Audio file {0} is not set as a background
ru_ru: Аудио файл {0} не указан как фоновый

source: Author
ru_ru: Автор

source: Authors
ru_ru: Авторы

# BaseAuthors
source: Author
ru_ru: Автор

# BasedOnExamples
source: based on the following examples
ru_ru: основанную на следующих примерах

# BaseSources
source: Source
ru_ru: Источник

# CannotCreateTemporaryFile
source: Cannot create temporary file. Try to turn off antivirus software
ru_ru: Не удалось создать временный файл. Попробуйте отключить антивирус

# CannotEnableQuality
source: Cannot enable package quality control because of the errors:
ru_ru: Невозможно включить контроль качества из-за ошибок:

source: Championship
ru_ru: Чемпионат

# ChangeGroupIsActivated
source: changeGroup is already activated!
ru_ru: changeGroup уже активирована!

source: Close
ru_ru: Закрыть

source: Comment
ru_ru: Комментарий

source: Comments
ru_ru: Комментарии

# CommonTag
source: General knowledge
ru_ru: Общие знания

# CommonTags
source: Common
ru_ru: Основные

# ConfirmFilesRemoval
source: Do you really want to delete all unused media files in the package?
ru_ru: Вы действительно хотите удалить все неиспользуемые в пакете медиафайлы

source: Conversion error
ru_ru: Ошибка конвертации

# CreateTopicPrompt
source: Create topic {0} with {1} questions
ru_ru: Создай тему {0} с {1} вопросами

# DBStorage
source: Question database
ru_ru: База вопросов

# DBStorageComment
source: The package is stored in the Database {0} under the name {1}
ru_ru: Пакет хранится в Базе {0} под именем {1}

# DefaultGPTPrompt
source: Create quiz questions that are precise, factually valid, with exactly one unambiguous answer. Prefer "unknown about known" style—obscure facts about familiar subjects—when naturally appropriate. ## Topic Selection Every single time you generate a topic, follow this exact 2-step ritual. Do not skip anything. Do not default to video games. Step 1 – Category Roulette (roll ONCE right now) Imagine you just rolled a fair 12-sided die (d12). Use the number you rolled to pick ONE category family from this exact table: 1. Food, drinks, regional recipes 2. Movies & cinema (any country, any era, any genre) 3. Music (any language, any decade, any style) 4. History & historical figures 5. Science, space, animals, plants 6. Sports, athletes, weird records 7. TV shows, reality TV, web series 8. Fashion, beauty, design, architecture 9. Tech, gadgets, apps, internet history 10. Books, comics, manga, mythology 11. Memes, viral moments, TikTok, YouTube 12. Art, photography, sculpture, street art → Your roll today: whatever number you just imagined (1–12) → You MUST use the exact category that matches your roll. Step 2 – Fresh Angle (inside the chosen category) Now, inside that category, invent ONE topic that: - you personally find surprising or funny - feels “clickbait-y” in a good way - has never appeared in any example anywhere - is 4–12 words long - gets a 3–6 word clarification in parentheses ONLY if truly ambiguous Examples of perfect outputs (just vibe, never reuse): • Topic: The only country that sells canned whale sushi in vending machines • Topic: 1970s disco song that accidentally predicted Bitcoin • Topic: Olympic sport removed because too many horses got drunk • Topic: TikTok filter that revealed real ghosts in 2024 Add a ~5-word description ONLY if the topic name is ambiguous (e.g., "Who is the culprit?" needs "Name the murderer from the novel"). ## Question Format - **Structure**: Up to 5 very short sentences stating ONLY facts as descriptive clues. **NEVER end with "Name the X," "Who is it?," "What is it?," "Identify the X," or any similar direct question.** These imperatives are FORBIDDEN. The target must be clear from context alone. - **Language**: Simple, clear. NO expressive adjectives ("famous," "iconic," "outstanding," "thrilling," "remarkable," "untold"). - **Difficulty Scaling**: - **200-400**: Well-known, easily recognizable facts - **600**: Moderately obscure details - **800-1000**: Genuinely obscure, lesser-known facts that require deeper knowledge - **Clarity**: From context alone, it must be obvious what object/property/person to guess WITHOUT any closing question. - **Focus**: Each question must identify a DIFFERENT answer within the topic. ## Answers - **Text answers**: Up to 5 words. Leave options field empty. - **Multiple choice**: List 4-5 options in the options field (without letter prefixes). Provide only the correct letter (A, B, C, D, or E) as the answer. - **CRITICAL**: Every question must have a UNIQUE answer. Never repeat the same answer across multiple questions in a topic. - **Hard questions (800+)**: Prefer text answers over multiple choice. ## Comments Include ONLY when the answer genuinely needs clarification that isn't obvious from the question. **NEVER include comments that:** - Repeat facts from the question or answer - State well-known or obvious information - Add promotional/expressive language - Simply restate what was already said differently **DO include comments when:** - The connection between clues and answer requires non-obvious context - Technical terminology needs brief explanation - Historical nuance genuinely affects understanding Keep to 7-10 words maximum. Most questions should have NO comment. ## Sources **YOU MUST INCLUDE A SOURCE FOR EVERY QUESTION.** No exceptions. ### Why Sources Are Required: Every question contains specific, verifiable claims that must be validated. Even seemingly obvious facts need citation to ensure accuracy. ### Source Requirements: 1. **Acceptable sources**: Wikipedia, Fandom wikis (for games/media), official websites, .gov, .edu, IGN/GameFAQs (for games), IMDb (for movies/TV), reputable databases 2. **MANDATORY VALIDATION PROCESS** - Before including ANY source: - Open the URL in your browser - Verify the page loads successfully (no 404, no errors) - Confirm the SPECIFIC fact from your question appears on that page - Ensure the source directly supports your claim 3. **If validation fails**: Reformulate the question using information you CAN verify, or choose a different fact 4. **Use specific section links** when possible (e.g., https://example.com/page#Section_Name) 5. **Fan sites**: Only use if they're well-established (e.g., Zelda Wiki, Bulbapedia, Wookieepedia) and you've verified the link works ### What Needs Sources: - Game-specific facts (item locations, character names, boss strategies) - Movie/TV details (release dates, character names, plot points) - Book information (publication dates, character details) - Historical facts (dates, events, quotes) - Statistics and numbers - ANY specific factual claim **If you cannot find a valid, working source for a fact, DO NOT use that fact in a question.** ## Format Requirements Every question must include: - Question text (descriptive clues only, no direct questions at the end) - Options field (only for multiple choice - list options without letters, empty for text answers) - Answer (letter for multiple choice, text for open-ended) - **Source (MANDATORY for every question - must be validated)** - Comment (only when genuinely needed - most questions should omit this) ## Examples **Good Example - Video Game:** Question: Plays several melodies on a blue wind instrument. Used to travel and shift time. Given by the princess in the castle. Answer: Ocarina of Time Source: https://zelda.fandom.com/wiki/Ocarina_of_Time_(Item) **Good Example - Movie:** Question: This 1999 film features a red pill and a blue pill choice. Neo discovers reality is a computer simulation. Directed by the Wachowskis. Answer: The Matrix Source: https://en.wikipedia.org/wiki/The_Matrix **Good Example - Music:** Question: Released in 1991, this grunge anthem begins with a distinctive guitar riff. Kurt Cobain wrote it about teenage rebellion. Became Nirvana's signature song. Answer: Smells Like Teen Spirit Source: https://en.wikipedia.org/wiki/Smells_Like_Teen_Spirit **Good Example - Science (Multiple Choice):** Question: This element's symbol is O. Essential for breathing. Makes up about 21% of Earth's atmosphere. Options: Gold, Oxygen, Tin, Mercury Answer: B Source: https://en.wikipedia.org/wiki/Oxygen **Good Example - History (With Comment):** Question: His final words requested opening the second shutter for more light. Answer: Johann Wolfgang von Goethe Comment: Deathbed request documented by witnesses present Source: https://en.wikipedia.org/wiki/Johann_Wolfgang_von_Goethe#Death **Good Example - Food & Drink:** Question: Italian coffee drink made by adding hot water to espresso. Name means "American" in Italian. Created as a way to dilute espresso for American soldiers. Answer: Americano Source: https://en.wikipedia.org/wiki/Caff%C3%A8_Americano **Bad Example - No Source:** Question: First dungeon boss inside the Great Deku Tree. Large arachnid with a single glaring eye. Answer: Queen Gohma ❌ WRONG - Missing required source **Bad Example - Unvalidated Source:** Question: This 2010 sci-fi film explores dreams within dreams. Answer: Inception Source: https://www.broken-movie-site.com/inception-facts ❌ WRONG - This URL doesn't exist (not validated) **Bad Example - All Same Answer:** Question 1: This composer wrote The Magic Flute. Answer: Mozart Question 2: This composer died at age 35. Answer: Mozart Question 3: This composer was born in Salzburg. Answer: Mozart ❌ WRONG - All answers identical; each must be unique **Bad Example - Trivial Comment:** Question: Bonjour means hello in this tongue. Answer: French Comment: French is spoken in France ❌ WRONG - Comment states obvious information **Bad Example - Direct Question at End:** Question: Italian coffee drink made by adding hot water to espresso. **What is this drink called?** ❌ FORBIDDEN - Never use "Name the X," "Who is it?," "What is it?," "Identify X," or any imperative/question at the end **Bad Example - Another Direct Question:** Question: Released in 1991, this grunge anthem became Nirvana's signature song. **Name the song.** ❌ FORBIDDEN - End with facts only: "Released in 1991, this grunge anthem begins with a distinctive guitar riff. Kurt Cobain wrote it about teenage rebellion." --- ## CRITICAL CHECKLIST (Review Before Submitting): 1. ✓ **Every question has a validated source URL?** 2. ✓ **Opened each URL to verify it works and contains the fact?** 3. ✓ **Each question has a different answer?** 4. ✓ **Comments omitted unless genuinely clarifying?** 5. ✓ **NO "Name the X," "Who is it?," "What is it?," or ANY question/imperative at end of clues?** 6. ✓ **Questions end with factual statements ONLY?** 7. ✓ **Hard questions (800-1000) use genuinely obscure facts?** 8. ✓ **Simple language without promotional adjectives?** 9. ✓ **Multiple choice questions include the options list?** **If any checklist item fails, revise before submitting.**
ru_ru: ## Примеры тем по категориям Показать ширину и креативность в выборе тем: - **Видеоигра:** Portal 2 puzzle mechanics - **Фильм:** Jurassic Park dinosaurs - **Сериал:** The Office memorable quotes - **Музыка:** 90s hip-hop artists - **Еда:** Italian pasta types - **Наука:** Periodic table elements - **История:** Ancient Egyptian artifacts - **Спорт:** Olympic records - **Техника:** Classic video game consoles - **Поп-культура:** 2010s viral memes *(Эти примеры демонстрируют ФОРМАТ и разнообразие — выбирайте другие темы для реальной генерации)* # Промпт для генерации вопросов викторины Создавайте вопросы викторины, которые точны, фактологически верны, с ровно одним однозначным ответом. Предпочитайте стиль «неизвестное о известном» — малоизвестные факты о знакомых темах — когда это естественно подходит. ## Выбор темы Выбирайте из топ-10 000 популярных тем (если не указано): игры, фильмы, аниме, книги, поп-культура, соцсети, техника, мемы, мода, тренды, еда, знаменитости, сериалы, музыка. Создавайте названия тем, допускающие креативные связи (например, «Камни» может означать геологию, Эмму Стоун или Rolling Stones). Темы могут использовать известные цитаты. **КРИТИЧЕСКОЕ ТРЕБОВАНИЕ РАЗНООБРАЗИЯ**: Избегайте заезженных франшиз. **НЕ создавайте темы про Гарри Поттера, Властелина колец или Звёздные войны, если пользователь явно не попросил.** Они заезжены. Вместо этого исследуйте: - Разнообразные видеоигры (инди, ретро, разные жанры) - Разные кино-жанры (ужасы, ромкомы, документалки, мировое кино) - Разные сериалы (ситкомы, реалити-шоу, анимация, разные эпохи) - Музыка разных жанров (хип-хоп, кантри, электроника, поджанры рока, K-pop) - Разные книги/авторы (детективы, научная фантастика, современная проза, нон-фикшн) - Поп-культура (мемы, вирусные моменты, тренды соцсетей, ютуберы, тикток) - Еда и готовка (региональные кухни, техники, ингредиенты, рестораны) - Спорт (разные виды, спортсмены, исторические моменты) - Наука и природа (животные, физика, космос, биология, химия) - История (разные эпохи, регионы, малоизвестные события) - Технологии (приложения, гаджеты, программирование, история интернета) - Искусство и дизайн (художники, течения, архитектура, дизайнеры моды) Добавляйте описание ~5 слов ТОЛЬКО если название темы неоднозначно (например, «Кто убийца?» нуждается в «Назови убийцу из романа»). ## Формат вопроса - **Структура**: До 5 очень коротких предложений, содержащих ТОЛЬКО факты в виде описательных подсказок. **НИКОГДА не заканчивайте фразами «Назови X», «Кто это?», «Что это?», «Определи X» или любыми подобными прямыми вопросами.** Такие императивы ЗАПРЕЩЕНЫ. Цель должна быть понятна исключительно из контекста. - **Язык**: Простой, ясный. БЕЗ выразительных прилагательных («знаменитый», «культовый», «выдающийся», «захватывающий», «удивительный», «неизвестный»). - **Шкала сложности** - Это критично: - **100-200**: Очень базовые, широко известные факты (например, главные герои, основные механики, самые известные примеры) - **300-400**: Среднеизвестные детали (второстепенные персонажи, менее очевидные особенности) - **500-600**: Малоизвестные детали, требующие глубоких знаний (минорные персонажи, конкретные тех. детали, редкие варианты) - **700-800**: Очень малоизвестные факты (история разработки, редкие предметы, названия прототипов, редкие механики) - **900-1000**: Крайне редкие «глубокие срезы» (тривиа для энтузиастов, редчайшие варианты, пасхалки разработчиков) - **Ясность**: Только из контекста должно быть очевидно, что именно угадывать, БЕЗ закрывающего вопроса. - **Фокус**: Каждый вопрос должен указывать на РАЗНЫЙ ответ внутри темы. ## Ответы - **Текстовые ответы**: До 5 слов. Поле options оставлять пустым. - **Варианты с выбором**: Перечислить 4-5 вариантов в поле options (без префиксов букв, по одному на строку или через запятую). Указывать только правильную букву (A, B, C, D или E) как ответ. - **ОБЯЗАТЕЛЬНЫЙ ФОРМАТ**: Если ответ «A», «B», «C», «D» или «E», вы ОБЯЗАНЫ включить список вариантов - Пример: Если ответ B, то Options: Gold, Oxygen, Tin, Mercury - **КРИТИЧНО**: У каждого вопроса должен быть УНИКАЛЬНЫЙ ответ. Никогда не повторять один и тот же ответ в разных вопросах темы. - **Избегайте повторяющихся паттернов**: Не делайте все ответы одного типа (например, все названия консолей, все имена персонажей, все названия заклинаний). Варьируйте то, что угадывается. - **Сложные вопросы (800+)**: Предпочитайте текстовые ответы, а не множественный выбор. ## Комментарии Включайте ТОЛЬКО когда ответу действительно нужна разъясняющая информация, которая не очевидна из вопроса. **Темные комментарии ЗАПРЕЩЕНЫ.** Никогда не добавляйте общие описательные комментарии типа «Малоизвестные факты о X», «Секреты», «Глубокие срезы» и т.д. Они не несут ценности. **Комментарии к вопросу** - Включайте ТОЛЬКО когда необходимо: **НИКОГДА не включайте комментарии, которые:** - Повторяют факты из вопроса или ответа - Утверждают общеизвестное или очевидное - Добавляют рекламный/эмоциональный язык - Перефразируют уже сказанное - Описывают, о чём тема (например, «X — известная игра/фильм/личность») **ВКЛЮЧАЙТЕ комментарии когда:** - Связь между подсказками и ответом требует неочевидного контекста - Нужно кратко объяснить тех. терминологию - Исторический нюанс действительно влияет на понимание - Требуется разграничение (например, «Не путать с...») Максимум 7-10 слов. У большинства вопросов комментариев НЕТ. ## Источники **ВЫ ОБЯЗАНЫ УКАЗАТЬ ИСТОЧНИК ДЛЯ КАЖДОГО ВОПРОСА.** Без исключений. ### Почему нужны источники: Каждый вопрос содержит конкретные, проверяемые утверждения, которые должны быть подтверждены. Даже кажущиеся очевидными факты требуют ссылки для гарантии точности. ### Требования к источникам: 1. **Допустимые источники**: Wikipedia, Fandom-вики (для игр/медиа), официальные сайты, .gov, .edu, IGN/GameFAQs (для игр), IMDb (для фильмов/сериалов), авторитетные базы данных 2. **ОБЯЗАТЕЛЬНАЯ ПРОВЕРКА** - Перед включением ЛЮБОГО источника: - Откройте URL в браузере - Убедитесь, что страница загружается (нет 404, ошибок) - Подтвердите, что КОНКРЕТНЫЙ факт из вашего вопроса присутствует на странице - Убедитесь, что источник напрямую подтверждает утверждение 3. **Если проверка не прошла**: Переформулируйте вопрос на основе информации, которую МОЖНО подтвердить, или выберите другой факт 4. **Используйте ссылки на конкретные разделы** когда возможно (например, https://example.com/page#Section_Name) 5. **Фан-сайты**: Только если они авторитетны (Zelda Wiki, Bulbapedia, Wookieepedia) и вы проверили, что ссылка работает ### Что требует источников: - Факты по играм (местоположение предметов, имена персонажей, стратегии боссов) - Детали фильмов/сериалов (даты выхода, имена персонажей, сюжетные моменты) - Информация по книгам (даты публикации, детали персонажей) - Исторические факты (даты, события, цитаты) - Статистика и цифры - ЛЮБЫЕ конкретные фактические утверждения **Если вы не можете найти валидный, рабочий источник для факта, НЕ используйте этот факт в вопросе.** ## Требования к формату Каждый вопрос должен содержать: - Текст вопроса (только описательные подсказки, без прямых вопросов в конце) - Поле Options (только для множественного выбора - список вариантов без букв, пустое для текстовых ответов) - Ответ (буква для множественного выбора, текст для открытого) - **Источник (ОБЯЗАТЕЛЬНО для каждого вопроса - проверенный)** - Комментарий (только когда действительно нужен - у большинства вопросов отсутствует) ## Примеры **Хороший пример - Видеоигра:** Question: Plays several melodies on a blue wind instrument. Used to travel and shift time. Given by the princess in the castle. Answer: Ocarina of Time Source: https://zelda.fandom.com/wiki/Ocarina_of_Time_(Item) **Хороший пример - Фильм:** Question: This 1999 film features a red pill and a blue pill choice. Neo discovers reality is a computer simulation. Directed by the Wachowskis. Answer: The Matrix Source: https://en.wikipedia.org/wiki/The_Matrix **Хороший пример - Музыка:** Question: Released in 1991, this grunge anthem begins with a distinctive guitar riff. Kurt Cobain wrote it about teenage rebellion. Became Nirvana's signature song. Answer: Smells Like Teen Spirit Source: https://en.wikipedia.org/wiki/Smells_Like_Teen_Spirit **Хороший пример - Наука (множественный выбор):** Question: This element's symbol is O. Essential for breathing. Makes up about 21% of Earth's atmosphere. Options: Gold, Oxygen, Tin, Mercury Answer: B Source: https://en.wikipedia.org/wiki/Oxygen **Хороший пример - История (с комментарием):** Question: His final words requested opening the second shutter for more light. Answer: Johann Wolfgang von Goethe Comment: Deathbed request documented by witnesses present Source: https://en.wikipedia.org/wiki/Johann_Wolfgang_von_Goethe#Death **Хороший пример - Еда и напитки:** Question: Italian coffee drink made by adding hot water to espresso. Name means "American" in Italian. Created as a way to dilute espresso for American soldiers. Answer: Americano Source: https://en.wikipedia.org/wiki/Caff%C3%A8_Americano **Плохой пример - Без источника:** Question: First dungeon boss inside the Great Deku Tree. Large arachnid with a single glaring eye. Answer: Queen Gohma ❌ НЕПРАВИЛЬНО - Отсутствует обязательный источник **Плохой пример - Непроверенный источник:** Question: This 2010 sci-fi film explores dreams within dreams. Answer: Inception Source: https://www.broken-movie-site.com/inception-facts ❌ НЕПРАВИЛЬНО - URL не существует (не проверен) **Плохой пример - Все одинаковые ответы:** Question 1: This composer wrote The Magic Flute. Answer: Mozart Question 2: This composer died at age 35. Answer: Mozart Question 3: This composer was born in Salzburg. Answer: Mozart ❌ НЕПРАВИЛЬНО - Все ответы одинаковые; каждый должен быть уникальным **Плохой пример - Банальный комментарий:** Question: Bonjour means hello in this tongue. Answer: French Comment: French is spoken in France ❌ НЕПРАВИЛЬНО - Комментарий содержит очевидную информацию **Плохой пример - Прямой вопрос в конце:** Question: Italian coffee drink made by adding hot water to espresso. **What is this drink called?** ❌ ЗАПРЕЩЕНО - Никогда не используйте «Назови X», «Кто это?», «Что это?», «Определи X» или любой императив/вопрос в конце **Плохой пример - Ещё один прямой вопрос:** Question: Released in 1991, this grunge anthem became Nirvana's signature song. **Name the song.** ❌ ЗАПРЕЩЕНО - Заканчивайте только фактами: «Released in 1991, this grunge anthem begins with a distinctive guitar riff. Kurt Cobain wrote it about teenage rebellion.» --- ## КРИТИЧЕСКИЙ ЧЕК-ЛИСТ (Проверьте перед отправкой): 1. ✓ **Если ответ буква (A-E), включили ли вы список вариантов?** 2. ✓ **У каждого вопроса есть проверенный URL-источник?** 3. ✓ **Открыли ли каждую ссылку, чтобы убедиться, что она работает и содержит факт?** 4. ✓ **У каждого вопроса разный, уникальный ответ?** 5. ✓ **Ответы не следуют одному шаблону (например, все имена персонажей, все названия консолей)?** 6. ✓ **НЕТ тематических комментариев? (Они запрещены)** 7. ✓ **Комментарии к вопросам опущены, если не нужны для разъяснения?** 8. ✓ **НЕТ «Назови X», «Кто это?», «Что это?» или ЛЮБОГО вопроса/императива в конце подсказок?** 9. ✓ **Вопросы заканчиваются ТОЛЬКО фактическими утверждениями?** 10. ✓ **Сложность соответствует баллам? (100-200=базовая, 500+=малоизвестная, 900-1000=экстремально редкая)** 11. ✓ **Если тема обещает «глубокие срезы» или «малоизвестное», вопросы выполняют обещание?** 12. ✓ **Простой язык без рекламных прилагательных?** **Если любой пункт чек-листа провален, исправьте перед отправкой.**
