Repository: VladimirKhil/SI
Catalog: src/SIQuester/SIQuester.ViewModel/Properties/Resources.*.resx
Languages: ru_ru

# DefaultTags
source: Cars Alphabet Anime Astronomy Biology Geography Games: Consoles, Soundtracks, Board games Art History Movies: Directors, Actors, Awards Books: Comics Memes Mathematics Music: Rock, Pop, Rap, Jazz, Metal, Electronic, Covers, Classical music Cartoons Rebuses Comics TV series Mixed (hodgepodge) Sports: Football TV Science fiction Physics Chemistry Erudition: Intellectual games, Politics, Personalities Humor
ru_ru: Автомобили|Cars Алфавит|Alphabet Аниме|Anime Астрономия|Astronomy Биология|Biology География|Geography Игры|Games: Консоли|Consoles, Саундтреки|Soundtracks, Настольные игры|Board games Искусство|Art История|History Кино|Movies: Режиссёры|Directors, Актёры|Actors, Премии|Awards Книги|Books: Комиксы|Comics Мемы|Memes Математика|Mathematics Музыка|Music: Рок|Rock, Поп|Pop, Рэп|Rap, Джаз|Jazz, Металл|Metal, Электроника|Electronic, Каверы|Covers, Русская музыка, Классическая музыка|Classical music Мультфильмы|Cartoons Ребусы|Rebuses Комиксы|Comics Сериалы|TV series Смешанная (солянка)| Mixed (hodgepodge) Спорт|Sports: Футбол|Football ТВ|TV Фантастика|Science fiction Физика|Physics Химия|Chemistry Эрудиция|Erudition: ЧГК|Intellectual games, Политика|Politics, Личности|Personalities Юмор|Humor

source: Document loading
ru_ru: Загрузка документа

# DocumentSavingError
source: Document save error
ru_ru: Ошибка сохранения документа

# DocxFiles
source: DOCX Documents
ru_ru: Документы DOCX

# DoYouWantToSave
source: Package {0} has been modified. Do you want to save it?
ru_ru: Пакет {0} был изменён. Вы хотите сохранить его?

source: Editors
ru_ru: Редакторы

# Empty
source: Untitled
ru_ru: Без имени

# EmptyValue
source: Empty
ru_ru: Пусто

# End
source: Stop
ru_ru: Стоп

# EnumerationError
source: An error in numbering was found in the next topic. It is expected that the text of all questions in each topic starts with a number, sequentially increasing from question to question
ru_ru: В следующей теме обнаружена ошибка нумерации. Ожидается, что текст всех вопросов в каждой теме начинается с номера, последовательно возрастающего от вопроса к вопросу. УБЕДИТЕСЬ, что в тексте нет номеров в начале строки помимо стоимостей вопросов. При необходимости удалите, перенесите или пропустите их

# ErrorInsertingBindedQuestion
source: Attempt to insert a linked question!
ru_ru: Попытка вставить привязанный вопрос!

source: Export
ru_ru: Экспорт

source: export and print
ru_ru: экспорт и печать

# ExportMedia
source: Media export
ru_ru: Экспорт медиа

# ExportMediaError
source: Media export error
ru_ru: Ошибка экспорта медиа

# ExportTableHeader
source: Export to table format
ru_ru: Экспорт в формат таблицы

source: export to HTML
ru_ru: экспорт в HTML

# ExportToHtmlHeader
source: SIGame questions
ru_ru: Вопросы "SIGame"

# ExportToSns
source: Export to CNS format
ru_ru: Экспорт в формат СНС

source: Export to Steam
ru_ru: Экспорт в Steam

# ExportToSteamEmptyQuestion
source: Question is empty
ru_ru: Вопрос без содержимого

# ExportToSteamEmptyRound
source: Empty round name
ru_ru: Пустое имя раунда

# ExportToSteamEmptyTheme
source: Empty theme name
ru_ru: Пустое имя темы

# ExportToSteamNoAnswer
source: Question answer is empty
ru_ru: Вопрос без ответа

# ExportToSteamNoQuestions
source: Package has no questions
ru_ru: Пакет не содержит вопросов

# ExportToSteamQualityControlDisabled
source: Enable package quality control
ru_ru: Для экспорта в Steam необходимо включить контроль качества

# ExternalLinksAreForbidden
source: External links are not allowed
ru_ru: Внешние ссылки не допускаются

source: Failed to parse GPT response
ru_ru: Не удалось разобрать ответ GPT

# FewQuestions
source: Insufficient number of questions
ru_ru: Недостаточное число вопросов

source: (file…)
ru_ru: (файл…)

# FileInMultipleCategories
source: File {0} is contained in the package in different categories!
ru_ru: Файл {0} содержится в пакете в разных категориях!

# FileIsDuplicated
source: File {0} is contained in the package twice!
ru_ru: Файл {0} содержится в пакете дважды!

# FileIsReadOnly
source: The file is read-only!
ru_ru: Файл доступен только для чтения!

source: File open error
ru_ru: Ошибка открытия файла

# FilesDownloaded
source: Files downloaded: {0}
ru_ru: Загружено файлов: {0}

source: File search
ru_ru: Поиск файлов

# FileSizeLimitExceed
source: The file size exceeds the allowable value for playing through the Game server ({0} MB)!
ru_ru: Размер файла превышает допустимое значение для игры через Игровой сервер ({0} МБ)!

source: FINAL
ru_ru: ФИНАЛ

# FinalName
source: FINAL
ru_ru: ФИНАЛ

# FragmentNotFound
source: The next template fragment was not found: {0}
ru_ru: Следующий фрагмент шаблона не обнаружен: {0}

# Futher
source: Continue
ru_ru: Продолжить

# GameNumber
source: GAME {0}
ru_ru: ИГРА {0}

# GamePackageTooLarge
source: File size exceeds 100 MB!
ru_ru: Размер файла превышает 100 Мб!

# GPTCreateTopicFinalRoundPrompt
source: Generate topic {0} with {1} hard quiz question that requires some time to think, some knowledge and maybe guessing. Each question has 3-4 sentences
ru_ru: Создайте тему {0} с {1} сложным вопросом для викторины, который требует времени на размышление, некоторых знаний и, возможно, догадок. Каждый вопрос содержит 3-4 предложения

# HasUpdates
source: Updates were found for the program from {0}. Download them now?
ru_ru: Обнаружены обновления программы от {0}. Загрузить их сейчас?

# HowToUseApp
source: How to use the program
ru_ru: Как использовать программу

source: HTML Files
ru_ru: Файлы HTML

source: Image
ru_ru: Изображение

source: Images
ru_ru: Изображения

# InColumn
source: In a column
ru_ru: В столбец

source: Info
ru_ru: Инфо

source: Initial upload
ru_ru: Начальная загрузка

# InputMediaUri
source: Enter the address of the multimedia object
ru_ru: Введите адрес мультимедиа-объекта

# InstallError
source: An error occurred
ru_ru: Произошла ошибка

# InvalidFileExtension
source: File {0} has invalid extension {1}. Expected one of {2}
ru_ru: Расширение файла {0} ({1}) недопустимо. Допустимые расширения: {2}

# InvalidFileSize
source: File {0} exceeds maximum size {1} MB
ru_ru: Размер файла {0} превышает допустимое значение {1} МБ

source: Invalid update handle
ru_ru: Неверный update handle

# Left
source: REMAINDER
ru_ru: ОСТАТОК

source: (link…)
ru_ru: (ссылка…)

# LostFile
source: Save the unprocessed part of the file to:
ru_ru: Сохранить необработанную часть файла в:

# MediaFileExtensionIsNotRecommended
source: Multimedia file extension is not among recommended ones ({0})!
ru_ru: Расширение мультимедиа файла не относится к рекомендуемым ({0})!

# MediaFileSizeExceedsRecommendedValue
source: Multimedia file size exceeds recommended value ({0} MB)!
ru_ru: Размер мультимедиа файла превышает рекомендуемое значение ({0} МБ)!

# MircAudio
source: audio
ru_ru: звук

# MircImage
source: image
ru_ru: изображение

# MircVideo
source: video
ru_ru: видео

source: Missing file
ru_ru: Отсутствует файл

source: Missing link
ru_ru: Отсутствует ссылка

# MissingLogoFile
source: Package logo: file {0} is missing!
ru_ru: Логотип пакета: отсутствует файл {0}!

# NameOfPackage
source: Name:
ru_ru: Имя:

# NewLine
source: Line break
ru_ru: Перевод строки

source: New package
ru_ru: Новый пакет

source: No
ru_ru: Нет

# NoAnswer
source: Correct answer is missing
ru_ru: Отсутствует правильный ответ

# NoAuthorName
source: Author's name is not entered!
ru_ru: Не введено имя автора!

# NoAuthors
source: Authors are missing
ru_ru: Отсутствуют авторы

# NoPackageName
source: Package name is not entered!
ru_ru: Не введено имя пакета!

# NoQuestion
source: Question text is missing
ru_ru: Отсутствует текст вопроса

# NoQuestionsFound
source: No questions were found in the input file! Note that questions must have a cost multiple of 10, and each question must start on a new line.
ru_ru: Во входном файле не обнаружены вопросы! Учтите, что вопросы должны иметь стоимость, кратную 10, и каждый вопрос должен начинаться с новой строки.

source: No questions to generate
ru_ru: Нет вопросов для генерации

# NoRiskQuestion
source: Question for yourself
ru_ru: Вопрос для себя

# NoSource
source: Source is missing
ru_ru: Отсутствует источник

# NotAQuestionNumber
source: This number is not a question cost
ru_ru: Это число не является стоимостью вопроса

# Notice
source: Please CAREFULLY familiarize yourself with the proposed format. Note that errors when reading a file may occur even due to the absence of a line break symbol or a space.
ru_ru: Просьба ВНИМАТЕЛЬНО ознакомиться с предложенным форматом. Учтите, что ошибки при прочтении файла могут возникать даже из-за отсутствия символа перевода строки или пробела

source: Number
ru_ru: Номер

# NumOfQuests
source: Question count
ru_ru: Число вопросов

# NumOfRounds
source: Round count
ru_ru: Число раундов

# NumOfThemes
source: Theme count
ru_ru: Число тем

# ObjectInNewFormat
source: Object is created in new format and could not be added to current package
ru_ru: Объект создан в новом формате и не может быть присоединён к данному пакету

# ObjectNotFound
source: The next object was not found: {0}
ru_ru: Следующий объект не обнаружен: {0}

# OfThemes
source: themes
ru_ru: тем

source: Open autosave folder
ru_ru: Открыть папку автосохранений

# OpenLogsFolder
source: Open log folder
ru_ru: Открыть папку с логами

# Options
source: Settings
ru_ru: Настройки

# OtherTypeQuestion
source: Other
ru_ru: Другой

source: Package
ru_ru: Пакет

# PackageClassicDescription
source: The same package as in the SIGame TV analogue
ru_ru: Такой же пакет, как и в Телевизионном аналоге SIGame

# PackageClassicName
source: Standard SIGame package
ru_ru: Стандартный пакет для SIGame

# PackageCorruptedHint
source: The question file is damaged! Try to extract data from it using an archiver (opening it as an archive)
ru_ru: Файл с вопросами повреждён! Попробуйте извлечь данные из него при помощи архиватора (открыв его как архив)

# PackageCorruptedHintAutoSave
source: or retrieve data from autosave
ru_ru: или получить данные из автосохранения

# PackageCorruptedHintLogs
source: If it does not work, send the logs to the program author so that the problem can be avoided in the future.
ru_ru: Если не получится, отправьте автору программы логи, чтобы можно было избежать проблемы в будущем

# PackageDemoDescription
source: Package that shows different game features
ru_ru: Пакет, показывающий различные возможности игры

# PackageDemoName
source: Demo package
ru_ru: Демонстрационный пакет

# PackageEmptyDescription
source: Package without initial content
ru_ru: Пакет, изначально ничего не содержащий

# PackageEmptyName
source: Empty package
ru_ru: Пустой пакет

# PackageInNewFormat
source: Package is created in new format and could not be added to current
ru_ru: Пакет создан в новом формате и не может быть присоединён к данному

# PackageServerFull
source: currently, there is no space on the server to accept new packages
ru_ru: в настоящий момент на сервере нет места для принятия новых пакетов

# PackageSpecialDescription
source: Package with custom count of rounds, themes or questions
ru_ru: Пакет, содержащий какое-то иное число раундов, тем или вопросов, чем в стандартной SIGame

# PackageSpecialName
source: Custom package
ru_ru: Нестандартный пакет

# PackageThemesCollectionDescription
source: A single round with themes
ru_ru: Просто набор тем

# PackageThemesCollectionName
source: Theme collection
ru_ru: Коллекция тем

# PhraseTemplates
source: The input text does not match the template below. Please correct the template, after which the analysis of the input file will continue. Besides, you can simply correct the input text. Problem:
ru_ru: Входной текст не соответствует нижеприведённому шаблону. Пожалуйста, поправьте шаблон, после чего анализ входного файла продолжится. Кроме того, вы всего-навсего можете поправить входной текст. Проблема:

source: Played
ru_ru: Играно

source: Preview upload
ru_ru: Отправка превью

# PreviewUploadError
source: Failed to submit Workshop preview
ru_ru: Ошибка отправки превью

# PreviewUploadSuccess
source: Preview uploaded successfully
ru_ru: Превью успешно отправлено

# QAnswer
source: Answer to the question
ru_ru: Ответ на вопрос

# QText
source: Question text
ru_ru: Текст вопроса

source: Question
ru_ru: Вопрос

source: Question count
ru_ru: Число вопросов

source: Question for all
ru_ru: Вопрос для всех

# QuestionPlay
source: Question playback
ru_ru: Проигрывание вопроса

# RemoveTemplateConfirm
source: Do you really want to delete template "{0}"?
ru_ru: Вы действительно хотите удалить шаблон "{0}"?

# Rest
source: REMAINDER
ru_ru: ОСТАТОК

# RestoreConfirmation
source: Files have been detected that were not correctly saved during the last work with the program. Restore them?
ru_ru: Обнаружены файлы, которые не были корректно сохранены при последней работе с программой. Восстановить их?

source: Restriction
ru_ru: Ограничение

source: Right answer
ru_ru: Правильный ответ

source: Round
ru_ru: Раунд

# RoundNameTemplate
source: Round {0}
ru_ru: {0}-й раунд

# RtfFiles
source: RTF Documents
ru_ru: Документы RTF

# SaveFile
source: The original file has been modified. Save it?
ru_ru: Оригинальный файл был изменён. Сохранить его?

# SecretNoQuestion
source: Secret question without a question
ru_ru: Вопрос с секретом без вопроса

# SecretPublicPrice
source: Secret question with cost announced before giving
ru_ru: Вопрос с секретом и стоимостью, объявляемой до передачи

source: Secret question
ru_ru: Вопрос с секретом

# SendPackageErrorHeader
source: Failed to send the package
ru_ru: Не удалось отправить пакет

# SendPackageSuccess
source: Package successfully sent!
ru_ru: Пакет успешно отправлен!

# SendToGame
source: Sending the package to the computer game
ru_ru: Отправка пакета в компьютерную игру

source: Separator
ru_ru: Разделитель

source: SIGame questions
ru_ru: Вопросы SIGame

# Simple
source: Regular
ru_ru: Обычный

# SimpleQuestion
source: Question with button
ru_ru: Вопрос с кнопкой

source: SI questions
ru_ru: Вопросы СИ

# SIStorage
source: SIGame Question Library
ru_ru: Библиотека вопросов SIGame

# SkipPart
source: Unrecognized text chunk will be added to the comments for the theme
ru_ru: Нераспознанный кусок текста будет добавлен в комментарии к теме

# SkipTitle
source: Unrecognized text chunk will be added to the comments for the package
ru_ru: Нераспознанный кусок текста будет добавлен в комментарии к пакету

source: Source
ru_ru: Источник

# SourceFail
source: In the original text, reading ended where the text highlighting ends.
ru_ru: В оригинальном тексте чтение закончилось там, где заканчивается подсветка текста.

source: Sources
ru_ru: Источники

source: Space
ru_ru: Пробел

# SplittingError
source: Error searching for questions
ru_ru: Ошибка при поиске вопросов

# StakeAllQuestion
source: Question for all with stake
ru_ru: Вопрос для всех со ставкой

# StakeQuestion
source: Question with stake
ru_ru: Вопрос со ставкой

source: Start
ru_ru: Старт

source: Starting upload...
ru_ru: Загрузка началась...

# Statistic
source: Statistics
ru_ru: Статистика

# SteamNotRunning
source: Steam is not running. Export is not possible
ru_ru: Steam не запущен. Экспорт невозможен

# Success
source: The input file has been completely read! The entire file header is placed in the package comments. Please sort its content yourself. Total imported themes:
ru_ru: Входной файл считан полностью! Весь заголовок файла помещён в комментарии к пакету. Просьба самостоятельно рассортировать его содержимое. Всего импортировано тем:

source: Tags
ru_ru: Теги

source: Template name
ru_ru: Имя шаблона

source: Template with this name already exists!
ru_ru: Шаблон с таким именем уже существует!

source: Text
ru_ru: Текст

source: Text files
ru_ru: Текстовые файлы

# TextImport
source: Import text
ru_ru: Импорт текста

source: Theme
ru_ru: Тема

# ThemesCollection
source: Theme collection
ru_ru: Коллекция тем

# ThemesSelection
source: theme selection
ru_ru: выбор тем

# ThinkAll
source: Think!
ru_ru: Думайте!

# ToBase
source: Export to Question Base
ru_ru: Экспорт в Базу Вопросов

# TotalImport
source: Total themes imported:
ru_ru: Всего импортировано тем:

source: Tour
ru_ru: Тур

# Transform
source: Transformation
ru_ru: Трансформация

source: Trash
ru_ru: Мусор

# TxtFilesFilter
source: Question files (*.txt) | *.txt
ru_ru: Файлы вопросов (*.txt) | *.txt

# Undefined
source: Not recognized:
ru_ru: Не распознано:

# UndoError
source: Error canceling the operation. Contact the developer.
ru_ru: Ошибка отмены операции. Обратитесь к разработчику.

# UnreadTemplate
source: Unmatched template
ru_ru: Не подошедший шаблон

# Unrecognized
source: There is unrecognized text
ru_ru: Имеется нераспознанный текст

# UnsupportedFragment
source: Unsupported fragment: {0}
ru_ru: Неподдерживаемый фрагмент: {0}

# UnsupportedVersion
source: Package version {0} is not supported. Maximum supported version is {1}
ru_ru: Версия пакета {0} не поддерживается. Максимальная поддерживаемая версия: {1}

# Untitled
source: Nameless
ru_ru: Безымянный

# UnusedFile
source: File {0} is not used. Delete it
ru_ru: Файл {0} не используется. Удалите его

# UploadError
source: Error during upload
ru_ru: Ошибка при отправке

# UploadSuccess
source: Workshop item created successfully
ru_ru: Объект Мастерской успешно создан

source: Video
ru_ru: Видео

# WorkshopItemCreationError
source: Failed to create Workshop item
ru_ru: Не удалось создать объект в Мастерской

source: Workshop items load error
ru_ru: Ошибка загрузки объектов Мастерской

# WorkshopItemUpdate
source: Item update
ru_ru: Обновление объекта

# WrongBrackets
source: Incorrect bracket placement
ru_ru: Некорректная расстановка скобок

# XmlFilesFilter
source: Question files (.xml) | *.xml
ru_ru: Файлы вопросов (*.xml) | *.xml

# XpsFiles
source: XPS documents
ru_ru: Документы XPS

source: YAML files
ru_ru: YAML файлы

# YamlFilesFilter
source: YAML files (.yaml) | *.yaml
ru_ru: YAML файлы (*.yaml) | *.yaml

source: Your answer?
ru_ru: Ваш ответ?

source: Your themes:
ru_ru: Ваши темы:
